/**
 * 在地区行政查询平台获取的信息
 */
const cityList =
    {
        "上海市": {
            "city": {
                "上海市": {
                    "code": "310000",
                    "country": {
                        "嘉定区": {
                            "code": "310114"
                        },
                        "奉贤区": {
                            "code": "310120"
                        },
                        "宝山区": {
                            "code": "310113"
                        },
                        "崇明区": {
                            "code": "310151"
                        },
                        "徐汇区": {
                            "code": "310104"
                        },
                        "普陀区": {
                            "code": "310107"
                        },
                        "杨浦区": {
                            "code": "310110"
                        },
                        "松江区": {
                            "code": "310117"
                        },
                        "浦东新区": {
                            "code": "310115"
                        },
                        "虹口区": {
                            "code": "310109"
                        },
                        "金山区": {
                            "code": "310116"
                        },
                        "长宁区": {
                            "code": "310105"
                        },
                        "闵行区": {
                            "code": "310112"
                        },
                        "青浦区": {
                            "code": "310118"
                        },
                        "静安区": {
                            "code": "310106"
                        },
                        "黄浦区": {
                            "code": "310101"
                        }
                    }
                }
            },
            "code": "310000"
        },
        "云南省": {
            "city": {
                "临沧市": {
                    "code": "530900",
                    "country": {
                        "临翔区": {
                            "code": "530902"
                        },
                        "云县": {
                            "code": "530922"
                        },
                        "凤庆县": {
                            "code": "530921"
                        },
                        "双江拉祜族佤族布朗族傣族自治县": {
                            "code": "530925"
                        },
                        "永德县": {
                            "code": "530923"
                        },
                        "沧源佤族自治县": {
                            "code": "530927"
                        },
                        "耿马傣族佤族自治县": {
                            "code": "530926"
                        },
                        "镇康县": {
                            "code": "530924"
                        }
                    }
                },
                "丽江市": {
                    "code": "530700",
                    "country": {
                        "华坪县": {
                            "code": "530723"
                        },
                        "古城区": {
                            "code": "530702"
                        },
                        "宁蒗彝族自治县": {
                            "code": "530724"
                        },
                        "永胜县": {
                            "code": "530722"
                        },
                        "玉龙纳西族自治县": {
                            "code": "530721"
                        }
                    }
                },
                "保山市": {
                    "code": "530500",
                    "country": {
                        "施甸县": {
                            "code": "530521"
                        },
                        "昌宁县": {
                            "code": "530524"
                        },
                        "腾冲市": {
                            "code": "530581"
                        },
                        "隆阳区": {
                            "code": "530502"
                        },
                        "龙陵县": {
                            "code": "530523"
                        }
                    }
                },
                "大理白族自治州": {
                    "code": "532900",
                    "country": {
                        "云龙县": {
                            "code": "532929"
                        },
                        "剑川县": {
                            "code": "532931"
                        },
                        "南涧彝族自治县": {
                            "code": "532926"
                        },
                        "大理市": {
                            "code": "532901"
                        },
                        "宾川县": {
                            "code": "532924"
                        },
                        "巍山彝族回族自治县": {
                            "code": "532927"
                        },
                        "弥渡县": {
                            "code": "532925"
                        },
                        "永平县": {
                            "code": "532928"
                        },
                        "洱源县": {
                            "code": "532930"
                        },
                        "漾濞彝族自治县": {
                            "code": "532922"
                        },
                        "祥云县": {
                            "code": "532923"
                        },
                        "鹤庆县": {
                            "code": "532932"
                        }
                    }
                },
                "德宏傣族景颇族自治州": {
                    "code": "533100",
                    "country": {
                        "梁河县": {
                            "code": "533122"
                        },
                        "瑞丽市": {
                            "code": "533102"
                        },
                        "盈江县": {
                            "code": "533123"
                        },
                        "芒市": {
                            "code": "533103"
                        },
                        "陇川县": {
                            "code": "533124"
                        }
                    }
                },
                "怒江傈僳族自治州": {
                    "code": "533300",
                    "country": {
                        "兰坪白族普米族自治县": {
                            "code": "533325"
                        },
                        "泸水市": {
                            "code": "533301"
                        },
                        "福贡县": {
                            "code": "533323"
                        },
                        "贡山独龙族怒族自治县": {
                            "code": "533324"
                        }
                    }
                },
                "文山壮族苗族自治州": {
                    "code": "532600",
                    "country": {
                        "丘北县": {
                            "code": "532626"
                        },
                        "富宁县": {
                            "code": "532628"
                        },
                        "广南县": {
                            "code": "532627"
                        },
                        "文山市": {
                            "code": "532601"
                        },
                        "砚山县": {
                            "code": "532622"
                        },
                        "西畴县": {
                            "code": "532623"
                        },
                        "马关县": {
                            "code": "532625"
                        },
                        "麻栗坡县": {
                            "code": "532624"
                        }
                    }
                },
                "昆明市": {
                    "code": "530100",
                    "country": {
                        "东川区": {
                            "code": "530113"
                        },
                        "五华区": {
                            "code": "530102"
                        },
                        "呈贡区": {
                            "code": "530114"
                        },
                        "安宁市": {
                            "code": "530181"
                        },
                        "官渡区": {
                            "code": "530111"
                        },
                        "宜良县": {
                            "code": "530125"
                        },
                        "富民县": {
                            "code": "530124"
                        },
                        "寻甸回族彝族自治县": {
                            "code": "530129"
                        },
                        "嵩明县": {
                            "code": "530127"
                        },
                        "晋宁区": {
                            "code": "530115"
                        },
                        "盘龙区": {
                            "code": "530103"
                        },
                        "石林彝族自治县": {
                            "code": "530126"
                        },
                        "禄劝彝族苗族自治县": {
                            "code": "530128"
                        },
                        "西山区": {
                            "code": "530112"
                        }
                    }
                },
                "昭通市": {
                    "code": "530600",
                    "country": {
                        "大关县": {
                            "code": "530624"
                        },
                        "威信县": {
                            "code": "530629"
                        },
                        "巧家县": {
                            "code": "530622"
                        },
                        "彝良县": {
                            "code": "530628"
                        },
                        "昭阳区": {
                            "code": "530602"
                        },
                        "水富市": {
                            "code": "530681"
                        },
                        "永善县": {
                            "code": "530625"
                        },
                        "盐津县": {
                            "code": "530623"
                        },
                        "绥江县": {
                            "code": "530626"
                        },
                        "镇雄县": {
                            "code": "530627"
                        },
                        "鲁甸县": {
                            "code": "530621"
                        }
                    }
                },
                "普洱市": {
                    "code": "530800",
                    "country": {
                        "墨江哈尼族自治县": {
                            "code": "530822"
                        },
                        "孟连傣族拉祜族佤族自治县": {
                            "code": "530827"
                        },
                        "宁洱哈尼族彝族自治县": {
                            "code": "530821"
                        },
                        "思茅区": {
                            "code": "530802"
                        },
                        "景东彝族自治县": {
                            "code": "530823"
                        },
                        "景谷傣族彝族自治县": {
                            "code": "530824"
                        },
                        "江城哈尼族彝族自治县": {
                            "code": "530826"
                        },
                        "澜沧拉祜族自治县": {
                            "code": "530828"
                        },
                        "西盟佤族自治县": {
                            "code": "530829"
                        },
                        "镇沅彝族哈尼族拉祜族自治县": {
                            "code": "530825"
                        }
                    }
                },
                "曲靖市": {
                    "code": "530300",
                    "country": {
                        "会泽县": {
                            "code": "530326"
                        },
                        "宣威市": {
                            "code": "530381"
                        },
                        "富源县": {
                            "code": "530325"
                        },
                        "师宗县": {
                            "code": "530323"
                        },
                        "沾益区": {
                            "code": "530303"
                        },
                        "罗平县": {
                            "code": "530324"
                        },
                        "陆良县": {
                            "code": "530322"
                        },
                        "马龙区": {
                            "code": "530304"
                        },
                        "麒麟区": {
                            "code": "530302"
                        }
                    }
                },
                "楚雄彝族自治州": {
                    "code": "532300",
                    "country": {
                        "元谋县": {
                            "code": "532328"
                        },
                        "南华县": {
                            "code": "532324"
                        },
                        "双柏县": {
                            "code": "532322"
                        },
                        "大姚县": {
                            "code": "532326"
                        },
                        "姚安县": {
                            "code": "532325"
                        },
                        "楚雄市": {
                            "code": "532301"
                        },
                        "武定县": {
                            "code": "532329"
                        },
                        "永仁县": {
                            "code": "532327"
                        },
                        "牟定县": {
                            "code": "532323"
                        },
                        "禄丰县": {
                            "code": "532331"
                        }
                    }
                },
                "玉溪市": {
                    "code": "530400",
                    "country": {
                        "元江哈尼族彝族傣族自治县": {
                            "code": "530428"
                        },
                        "华宁县": {
                            "code": "530424"
                        },
                        "峨山彝族自治县": {
                            "code": "530426"
                        },
                        "新平彝族傣族自治县": {
                            "code": "530427"
                        },
                        "易门县": {
                            "code": "530425"
                        },
                        "江川区": {
                            "code": "530403"
                        },
                        "澄江市": {
                            "code": "530481"
                        },
                        "红塔区": {
                            "code": "530402"
                        },
                        "通海县": {
                            "code": "530423"
                        }
                    }
                },
                "红河哈尼族彝族自治州": {
                    "code": "532500",
                    "country": {
                        "个旧市": {
                            "code": "532501"
                        },
                        "元阳县": {
                            "code": "532528"
                        },
                        "屏边苗族自治县": {
                            "code": "532523"
                        },
                        "建水县": {
                            "code": "532524"
                        },
                        "开远市": {
                            "code": "532502"
                        },
                        "弥勒市": {
                            "code": "532504"
                        },
                        "河口瑶族自治县": {
                            "code": "532532"
                        },
                        "泸西县": {
                            "code": "532527"
                        },
                        "石屏县": {
                            "code": "532525"
                        },
                        "红河县": {
                            "code": "532529"
                        },
                        "绿春县": {
                            "code": "532531"
                        },
                        "蒙自市": {
                            "code": "532503"
                        },
                        "金平苗族瑶族傣族自治县": {
                            "code": "532530"
                        }
                    }
                },
                "西双版纳傣族自治州": {
                    "code": "532800",
                    "country": {
                        "勐海县": {
                            "code": "532822"
                        },
                        "勐腊县": {
                            "code": "532823"
                        },
                        "景洪市": {
                            "code": "532801"
                        }
                    }
                },
                "迪庆藏族自治州": {
                    "code": "533400",
                    "country": {
                        "德钦县": {
                            "code": "533422"
                        },
                        "维西傈僳族自治县": {
                            "code": "533423"
                        },
                        "香格里拉市": {
                            "code": "533401"
                        }
                    }
                }
            },
            "code": "530000"
        },
        "内蒙古自治区": {
            "city": {
                "乌兰察布市": {
                    "code": "150900",
                    "country": {
                        "丰镇市": {
                            "code": "150981"
                        },
                        "兴和县": {
                            "code": "150924"
                        },
                        "凉城县": {
                            "code": "150925"
                        },
                        "化德县": {
                            "code": "150922"
                        },
                        "卓资县": {
                            "code": "150921"
                        },
                        "商都县": {
                            "code": "150923"
                        },
                        "四子王旗": {
                            "code": "150929"
                        },
                        "察哈尔右翼中旗": {
                            "code": "150927"
                        },
                        "察哈尔右翼前旗": {
                            "code": "150926"
                        },
                        "察哈尔右翼后旗": {
                            "code": "150928"
                        },
                        "集宁区": {
                            "code": "150902"
                        }
                    }
                },
                "乌海市": {
                    "code": "150300",
                    "country": {
                        "乌达区": {
                            "code": "150304"
                        },
                        "海勃湾区": {
                            "code": "150302"
                        },
                        "海南区": {
                            "code": "150303"
                        }
                    }
                },
                "兴安盟": {
                    "code": "152200",
                    "country": {
                        "乌兰浩特市": {
                            "code": "152201"
                        },
                        "扎赉特旗": {
                            "code": "152223"
                        },
                        "科尔沁右翼中旗": {
                            "code": "152222"
                        },
                        "科尔沁右翼前旗": {
                            "code": "152221"
                        },
                        "突泉县": {
                            "code": "152224"
                        },
                        "阿尔山市": {
                            "code": "152202"
                        }
                    }
                },
                "包头市": {
                    "code": "150200",
                    "country": {
                        "东河区": {
                            "code": "150202"
                        },
                        "九原区": {
                            "code": "150207"
                        },
                        "固阳县": {
                            "code": "150222"
                        },
                        "土默特右旗": {
                            "code": "150221"
                        },
                        "昆都仑区": {
                            "code": "150203"
                        },
                        "白云鄂博矿区": {
                            "code": "150206"
                        },
                        "石拐区": {
                            "code": "150205"
                        },
                        "达尔罕茂明安联合旗": {
                            "code": "150223"
                        },
                        "青山区": {
                            "code": "150204"
                        }
                    }
                },
                "呼伦贝尔市": {
                    "code": "150700",
                    "country": {
                        "扎兰屯市": {
                            "code": "150783"
                        },
                        "扎赉诺尔区": {
                            "code": "150703"
                        },
                        "新巴尔虎右旗": {
                            "code": "150727"
                        },
                        "新巴尔虎左旗": {
                            "code": "150726"
                        },
                        "根河市": {
                            "code": "150785"
                        },
                        "海拉尔区": {
                            "code": "150702"
                        },
                        "满洲里市": {
                            "code": "150781"
                        },
                        "牙克石市": {
                            "code": "150782"
                        },
                        "莫力达瓦达斡尔族自治旗": {
                            "code": "150722"
                        },
                        "鄂伦春自治旗": {
                            "code": "150723"
                        },
                        "鄂温克族自治旗": {
                            "code": "150724"
                        },
                        "阿荣旗": {
                            "code": "150721"
                        },
                        "陈巴尔虎旗": {
                            "code": "150725"
                        },
                        "额尔古纳市": {
                            "code": "150784"
                        }
                    }
                },
                "呼和浩特市": {
                    "code": "150100",
                    "country": {
                        "和林格尔县": {
                            "code": "150123"
                        },
                        "回民区": {
                            "code": "150103"
                        },
                        "土默特左旗": {
                            "code": "150121"
                        },
                        "托克托县": {
                            "code": "150122"
                        },
                        "新城区": {
                            "code": "150102"
                        },
                        "武川县": {
                            "code": "150125"
                        },
                        "清水河县": {
                            "code": "150124"
                        },
                        "玉泉区": {
                            "code": "150104"
                        },
                        "赛罕区": {
                            "code": "150105"
                        }
                    }
                },
                "巴彦淖尔市": {
                    "code": "150800",
                    "country": {
                        "临河区": {
                            "code": "150802"
                        },
                        "乌拉特中旗": {
                            "code": "150824"
                        },
                        "乌拉特前旗": {
                            "code": "150823"
                        },
                        "乌拉特后旗": {
                            "code": "150825"
                        },
                        "五原县": {
                            "code": "150821"
                        },
                        "杭锦后旗": {
                            "code": "150826"
                        },
                        "磴口县": {
                            "code": "150822"
                        }
                    }
                },
                "赤峰市": {
                    "code": "150400",
                    "country": {
                        "元宝山区": {
                            "code": "150403"
                        },
                        "克什克腾旗": {
                            "code": "150425"
                        },
                        "喀喇沁旗": {
                            "code": "150428"
                        },
                        "宁城县": {
                            "code": "150429"
                        },
                        "巴林右旗": {
                            "code": "150423"
                        },
                        "巴林左旗": {
                            "code": "150422"
                        },
                        "敖汉旗": {
                            "code": "150430"
                        },
                        "松山区": {
                            "code": "150404"
                        },
                        "林西县": {
                            "code": "150424"
                        },
                        "红山区": {
                            "code": "150402"
                        },
                        "翁牛特旗": {
                            "code": "150426"
                        },
                        "阿鲁科尔沁旗": {
                            "code": "150421"
                        }
                    }
                },
                "通辽市": {
                    "code": "150500",
                    "country": {
                        "奈曼旗": {
                            "code": "150525"
                        },
                        "库伦旗": {
                            "code": "150524"
                        },
                        "开鲁县": {
                            "code": "150523"
                        },
                        "扎鲁特旗": {
                            "code": "150526"
                        },
                        "科尔沁区": {
                            "code": "150502"
                        },
                        "科尔沁左翼中旗": {
                            "code": "150521"
                        },
                        "科尔沁左翼后旗": {
                            "code": "150522"
                        },
                        "霍林郭勒市": {
                            "code": "150581"
                        }
                    }
                },
                "鄂尔多斯市": {
                    "code": "150600",
                    "country": {
                        "东胜区": {
                            "code": "150602"
                        },
                        "乌审旗": {
                            "code": "150626"
                        },
                        "伊金霍洛旗": {
                            "code": "150627"
                        },
                        "准格尔旗": {
                            "code": "150622"
                        },
                        "康巴什区": {
                            "code": "150603"
                        },
                        "杭锦旗": {
                            "code": "150625"
                        },
                        "达拉特旗": {
                            "code": "150621"
                        },
                        "鄂托克前旗": {
                            "code": "150623"
                        },
                        "鄂托克旗": {
                            "code": "150624"
                        }
                    }
                },
                "锡林郭勒盟": {
                    "code": "152500",
                    "country": {
                        "东乌珠穆沁旗": {
                            "code": "152525"
                        },
                        "二连浩特市": {
                            "code": "152501"
                        },
                        "多伦县": {
                            "code": "152531"
                        },
                        "太仆寺旗": {
                            "code": "152527"
                        },
                        "正蓝旗": {
                            "code": "152530"
                        },
                        "正镶白旗": {
                            "code": "152529"
                        },
                        "苏尼特右旗": {
                            "code": "152524"
                        },
                        "苏尼特左旗": {
                            "code": "152523"
                        },
                        "西乌珠穆沁旗": {
                            "code": "152526"
                        },
                        "锡林浩特市": {
                            "code": "152502"
                        },
                        "镶黄旗": {
                            "code": "152528"
                        },
                        "阿巴嘎旗": {
                            "code": "152522"
                        }
                    }
                },
                "阿拉善盟": {
                    "code": "152900",
                    "country": {
                        "阿拉善右旗": {
                            "code": "152922"
                        },
                        "阿拉善左旗": {
                            "code": "152921"
                        },
                        "额济纳旗": {
                            "code": "152923"
                        }
                    }
                }
            },
            "code": "150000"
        },
        "北京市": {
            "city": {
                "北京市": {
                    "code": "110000",
                    "country": {
                        "东城区": {
                            "code": "110101"
                        },
                        "丰台区": {
                            "code": "110106"
                        },
                        "大兴区": {
                            "code": "110115"
                        },
                        "密云区": {
                            "code": "110118"
                        },
                        "平谷区": {
                            "code": "110117"
                        },
                        "延庆区": {
                            "code": "110119"
                        },
                        "怀柔区": {
                            "code": "110116"
                        },
                        "房山区": {
                            "code": "110111"
                        },
                        "昌平区": {
                            "code": "110114"
                        },
                        "朝阳区": {
                            "code": "110105"
                        },
                        "海淀区": {
                            "code": "110108"
                        },
                        "石景山区": {
                            "code": "110107"
                        },
                        "西城区": {
                            "code": "110102"
                        },
                        "通州区": {
                            "code": "110112"
                        },
                        "门头沟区": {
                            "code": "110109"
                        },
                        "顺义区": {
                            "code": "110113"
                        }
                    }
                }
            },
            "code": "110000"
        },
        "台湾省": {
            "city": {},
            "code": "710000"
        },
        "吉林省": {
            "city": {
                "吉林市": {
                    "code": "220200",
                    "country": {
                        "丰满区": {
                            "code": "220211"
                        },
                        "昌邑区": {
                            "code": "220202"
                        },
                        "桦甸市": {
                            "code": "220282"
                        },
                        "永吉县": {
                            "code": "220221"
                        },
                        "磐石市": {
                            "code": "220284"
                        },
                        "舒兰市": {
                            "code": "220283"
                        },
                        "船营区": {
                            "code": "220204"
                        },
                        "蛟河市": {
                            "code": "220281"
                        },
                        "龙潭区": {
                            "code": "220203"
                        }
                    }
                },
                "四平市": {
                    "code": "220300",
                    "country": {
                        "伊通满族自治县": {
                            "code": "220323"
                        },
                        "公主岭市": {
                            "code": "220381"
                        },
                        "双辽市": {
                            "code": "220382"
                        },
                        "梨树县": {
                            "code": "220322"
                        },
                        "铁东区": {
                            "code": "220303"
                        },
                        "铁西区": {
                            "code": "220302"
                        }
                    }
                },
                "延边朝鲜族自治州": {
                    "code": "222400",
                    "country": {
                        "和龙市": {
                            "code": "222406"
                        },
                        "图们市": {
                            "code": "222402"
                        },
                        "安图县": {
                            "code": "222426"
                        },
                        "延吉市": {
                            "code": "222401"
                        },
                        "敦化市": {
                            "code": "222403"
                        },
                        "汪清县": {
                            "code": "222424"
                        },
                        "珲春市": {
                            "code": "222404"
                        },
                        "龙井市": {
                            "code": "222405"
                        }
                    }
                },
                "松原市": {
                    "code": "220700",
                    "country": {
                        "乾安县": {
                            "code": "220723"
                        },
                        "前郭尔罗斯蒙古族自治县": {
                            "code": "220721"
                        },
                        "宁江区": {
                            "code": "220702"
                        },
                        "扶余市": {
                            "code": "220781"
                        },
                        "长岭县": {
                            "code": "220722"
                        }
                    }
                },
                "白城市": {
                    "code": "220800",
                    "country": {
                        "大安市": {
                            "code": "220882"
                        },
                        "洮北区": {
                            "code": "220802"
                        },
                        "洮南市": {
                            "code": "220881"
                        },
                        "通榆县": {
                            "code": "220822"
                        },
                        "镇赉县": {
                            "code": "220821"
                        }
                    }
                },
                "白山市": {
                    "code": "220600",
                    "country": {
                        "临江市": {
                            "code": "220681"
                        },
                        "抚松县": {
                            "code": "220621"
                        },
                        "江源区": {
                            "code": "220605"
                        },
                        "浑江区": {
                            "code": "220602"
                        },
                        "长白朝鲜族自治县": {
                            "code": "220623"
                        },
                        "靖宇县": {
                            "code": "220622"
                        }
                    }
                },
                "辽源市": {
                    "code": "220400",
                    "country": {
                        "东丰县": {
                            "code": "220421"
                        },
                        "东辽县": {
                            "code": "220422"
                        },
                        "西安区": {
                            "code": "220403"
                        },
                        "龙山区": {
                            "code": "220402"
                        }
                    }
                },
                "通化市": {
                    "code": "220500",
                    "country": {
                        "东昌区": {
                            "code": "220502"
                        },
                        "二道江区": {
                            "code": "220503"
                        },
                        "柳河县": {
                            "code": "220524"
                        },
                        "梅河口市": {
                            "code": "220581"
                        },
                        "辉南县": {
                            "code": "220523"
                        },
                        "通化县": {
                            "code": "220521"
                        },
                        "集安市": {
                            "code": "220582"
                        }
                    }
                },
                "长春市": {
                    "code": "220100",
                    "country": {
                        "九台区": {
                            "code": "220113"
                        },
                        "二道区": {
                            "code": "220105"
                        },
                        "农安县": {
                            "code": "220122"
                        },
                        "南关区": {
                            "code": "220102"
                        },
                        "双阳区": {
                            "code": "220112"
                        },
                        "宽城区": {
                            "code": "220103"
                        },
                        "德惠市": {
                            "code": "220183"
                        },
                        "朝阳区": {
                            "code": "220104"
                        },
                        "榆树市": {
                            "code": "220182"
                        },
                        "绿园区": {
                            "code": "220106"
                        }
                    }
                }
            },
            "code": "220000"
        },
        "四川省": {
            "city": {
                "乐山市": {
                    "code": "511100",
                    "country": {
                        "五通桥区": {
                            "code": "511112"
                        },
                        "井研县": {
                            "code": "511124"
                        },
                        "夹江县": {
                            "code": "511126"
                        },
                        "峨眉山市": {
                            "code": "511181"
                        },
                        "峨边彝族自治县": {
                            "code": "511132"
                        },
                        "市中区": {
                            "code": "511102"
                        },
                        "沐川县": {
                            "code": "511129"
                        },
                        "沙湾区": {
                            "code": "511111"
                        },
                        "犍为县": {
                            "code": "511123"
                        },
                        "金口河区": {
                            "code": "511113"
                        },
                        "马边彝族自治县": {
                            "code": "511133"
                        }
                    }
                },
                "内江市": {
                    "code": "511000",
                    "country": {
                        "东兴区": {
                            "code": "511011"
                        },
                        "威远县": {
                            "code": "511024"
                        },
                        "市中区": {
                            "code": "511002"
                        },
                        "资中县": {
                            "code": "511025"
                        },
                        "隆昌市": {
                            "code": "511083"
                        }
                    }
                },
                "凉山彝族自治州": {
                    "code": "513400",
                    "country": {
                        "会东县": {
                            "code": "513426"
                        },
                        "会理县": {
                            "code": "513425"
                        },
                        "冕宁县": {
                            "code": "513433"
                        },
                        "喜德县": {
                            "code": "513432"
                        },
                        "宁南县": {
                            "code": "513427"
                        },
                        "布拖县": {
                            "code": "513429"
                        },
                        "德昌县": {
                            "code": "513424"
                        },
                        "昭觉县": {
                            "code": "513431"
                        },
                        "普格县": {
                            "code": "513428"
                        },
                        "木里藏族自治县": {
                            "code": "513422"
                        },
                        "甘洛县": {
                            "code": "513435"
                        },
                        "盐源县": {
                            "code": "513423"
                        },
                        "美姑县": {
                            "code": "513436"
                        },
                        "西昌市": {
                            "code": "513401"
                        },
                        "越西县": {
                            "code": "513434"
                        },
                        "金阳县": {
                            "code": "513430"
                        },
                        "雷波县": {
                            "code": "513437"
                        }
                    }
                },
                "南充市": {
                    "code": "511300",
                    "country": {
                        "仪陇县": {
                            "code": "511324"
                        },
                        "南部县": {
                            "code": "511321"
                        },
                        "嘉陵区": {
                            "code": "511304"
                        },
                        "营山县": {
                            "code": "511322"
                        },
                        "蓬安县": {
                            "code": "511323"
                        },
                        "西充县": {
                            "code": "511325"
                        },
                        "阆中市": {
                            "code": "511381"
                        },
                        "顺庆区": {
                            "code": "511302"
                        },
                        "高坪区": {
                            "code": "511303"
                        }
                    }
                },
                "宜宾市": {
                    "code": "511500",
                    "country": {
                        "兴文县": {
                            "code": "511528"
                        },
                        "南溪区": {
                            "code": "511503"
                        },
                        "叙州区": {
                            "code": "511504"
                        },
                        "屏山县": {
                            "code": "511529"
                        },
                        "江安县": {
                            "code": "511523"
                        },
                        "珙县": {
                            "code": "511526"
                        },
                        "筠连县": {
                            "code": "511527"
                        },
                        "翠屏区": {
                            "code": "511502"
                        },
                        "长宁县": {
                            "code": "511524"
                        },
                        "高县": {
                            "code": "511525"
                        }
                    }
                },
                "巴中市": {
                    "code": "511900",
                    "country": {
                        "南江县": {
                            "code": "511922"
                        },
                        "巴州区": {
                            "code": "511902"
                        },
                        "平昌县": {
                            "code": "511923"
                        },
                        "恩阳区": {
                            "code": "511903"
                        },
                        "通江县": {
                            "code": "511921"
                        }
                    }
                },
                "广元市": {
                    "code": "510800",
                    "country": {
                        "利州区": {
                            "code": "510802"
                        },
                        "剑阁县": {
                            "code": "510823"
                        },
                        "旺苍县": {
                            "code": "510821"
                        },
                        "昭化区": {
                            "code": "510811"
                        },
                        "朝天区": {
                            "code": "510812"
                        },
                        "苍溪县": {
                            "code": "510824"
                        },
                        "青川县": {
                            "code": "510822"
                        }
                    }
                },
                "广安市": {
                    "code": "511600",
                    "country": {
                        "前锋区": {
                            "code": "511603"
                        },
                        "华蓥市": {
                            "code": "511681"
                        },
                        "岳池县": {
                            "code": "511621"
                        },
                        "广安区": {
                            "code": "511602"
                        },
                        "武胜县": {
                            "code": "511622"
                        },
                        "邻水县": {
                            "code": "511623"
                        }
                    }
                },
                "德阳市": {
                    "code": "510600",
                    "country": {
                        "中江县": {
                            "code": "510623"
                        },
                        "什邡市": {
                            "code": "510682"
                        },
                        "广汉市": {
                            "code": "510681"
                        },
                        "旌阳区": {
                            "code": "510603"
                        },
                        "绵竹市": {
                            "code": "510683"
                        },
                        "罗江区": {
                            "code": "510604"
                        }
                    }
                },
                "成都市": {
                    "code": "510100",
                    "country": {
                        "双流区": {
                            "code": "510116"
                        },
                        "大邑县": {
                            "code": "510129"
                        },
                        "崇州市": {
                            "code": "510184"
                        },
                        "彭州市": {
                            "code": "510182"
                        },
                        "成华区": {
                            "code": "510108"
                        },
                        "新津县": {
                            "code": "510132"
                        },
                        "新都区": {
                            "code": "510114"
                        },
                        "武侯区": {
                            "code": "510107"
                        },
                        "温江区": {
                            "code": "510115"
                        },
                        "简阳市": {
                            "code": "510185"
                        },
                        "蒲江县": {
                            "code": "510131"
                        },
                        "邛崃市": {
                            "code": "510183"
                        },
                        "郫都区": {
                            "code": "510117"
                        },
                        "都江堰市": {
                            "code": "510181"
                        },
                        "金堂县": {
                            "code": "510121"
                        },
                        "金牛区": {
                            "code": "510106"
                        },
                        "锦江区": {
                            "code": "510104"
                        },
                        "青白江区": {
                            "code": "510113"
                        },
                        "青羊区": {
                            "code": "510105"
                        },
                        "龙泉驿区": {
                            "code": "510112"
                        }
                    }
                },
                "攀枝花市": {
                    "code": "510400",
                    "country": {
                        "东区": {
                            "code": "510402"
                        },
                        "仁和区": {
                            "code": "510411"
                        },
                        "盐边县": {
                            "code": "510422"
                        },
                        "米易县": {
                            "code": "510421"
                        },
                        "西区": {
                            "code": "510403"
                        }
                    }
                },
                "泸州市": {
                    "code": "510500",
                    "country": {
                        "叙永县": {
                            "code": "510524"
                        },
                        "古蔺县": {
                            "code": "510525"
                        },
                        "合江县": {
                            "code": "510522"
                        },
                        "江阳区": {
                            "code": "510502"
                        },
                        "泸县": {
                            "code": "510521"
                        },
                        "纳溪区": {
                            "code": "510503"
                        },
                        "龙马潭区": {
                            "code": "510504"
                        }
                    }
                },
                "甘孜藏族自治州": {
                    "code": "513300",
                    "country": {
                        "丹巴县": {
                            "code": "513323"
                        },
                        "九龙县": {
                            "code": "513324"
                        },
                        "乡城县": {
                            "code": "513336"
                        },
                        "巴塘县": {
                            "code": "513335"
                        },
                        "康定市": {
                            "code": "513301"
                        },
                        "得荣县": {
                            "code": "513338"
                        },
                        "德格县": {
                            "code": "513330"
                        },
                        "新龙县": {
                            "code": "513329"
                        },
                        "泸定县": {
                            "code": "513322"
                        },
                        "炉霍县": {
                            "code": "513327"
                        },
                        "理塘县": {
                            "code": "513334"
                        },
                        "甘孜县": {
                            "code": "513328"
                        },
                        "白玉县": {
                            "code": "513331"
                        },
                        "石渠县": {
                            "code": "513332"
                        },
                        "稻城县": {
                            "code": "513337"
                        },
                        "色达县": {
                            "code": "513333"
                        },
                        "道孚县": {
                            "code": "513326"
                        },
                        "雅江县": {
                            "code": "513325"
                        }
                    }
                },
                "眉山市": {
                    "code": "511400",
                    "country": {
                        "东坡区": {
                            "code": "511402"
                        },
                        "丹棱县": {
                            "code": "511424"
                        },
                        "仁寿县": {
                            "code": "511421"
                        },
                        "彭山区": {
                            "code": "511403"
                        },
                        "洪雅县": {
                            "code": "511423"
                        },
                        "青神县": {
                            "code": "511425"
                        }
                    }
                },
                "绵阳市": {
                    "code": "510700",
                    "country": {
                        "三台县": {
                            "code": "510722"
                        },
                        "北川羌族自治县": {
                            "code": "510726"
                        },
                        "安州区": {
                            "code": "510705"
                        },
                        "平武县": {
                            "code": "510727"
                        },
                        "梓潼县": {
                            "code": "510725"
                        },
                        "江油市": {
                            "code": "510781"
                        },
                        "涪城区": {
                            "code": "510703"
                        },
                        "游仙区": {
                            "code": "510704"
                        },
                        "盐亭县": {
                            "code": "510723"
                        }
                    }
                },
                "自贡市": {
                    "code": "510300",
                    "country": {
                        "大安区": {
                            "code": "510304"
                        },
                        "富顺县": {
                            "code": "510322"
                        },
                        "沿滩区": {
                            "code": "510311"
                        },
                        "自流井区": {
                            "code": "510302"
                        },
                        "荣县": {
                            "code": "510321"
                        },
                        "贡井区": {
                            "code": "510303"
                        }
                    }
                },
                "资阳市": {
                    "code": "512000",
                    "country": {
                        "乐至县": {
                            "code": "512022"
                        },
                        "安岳县": {
                            "code": "512021"
                        },
                        "雁江区": {
                            "code": "512002"
                        }
                    }
                },
                "达州市": {
                    "code": "511700",
                    "country": {
                        "万源市": {
                            "code": "511781"
                        },
                        "大竹县": {
                            "code": "511724"
                        },
                        "宣汉县": {
                            "code": "511722"
                        },
                        "开江县": {
                            "code": "511723"
                        },
                        "渠县": {
                            "code": "511725"
                        },
                        "达川区": {
                            "code": "511703"
                        },
                        "通川区": {
                            "code": "511702"
                        }
                    }
                },
                "遂宁市": {
                    "code": "510900",
                    "country": {
                        "大英县": {
                            "code": "510923"
                        },
                        "安居区": {
                            "code": "510904"
                        },
                        "射洪市": {
                            "code": "510981"
                        },
                        "船山区": {
                            "code": "510903"
                        },
                        "蓬溪县": {
                            "code": "510921"
                        }
                    }
                },
                "阿坝藏族羌族自治州": {
                    "code": "513200",
                    "country": {
                        "九寨沟县": {
                            "code": "513225"
                        },
                        "壤塘县": {
                            "code": "513230"
                        },
                        "小金县": {
                            "code": "513227"
                        },
                        "松潘县": {
                            "code": "513224"
                        },
                        "汶川县": {
                            "code": "513221"
                        },
                        "理县": {
                            "code": "513222"
                        },
                        "红原县": {
                            "code": "513233"
                        },
                        "若尔盖县": {
                            "code": "513232"
                        },
                        "茂县": {
                            "code": "513223"
                        },
                        "金川县": {
                            "code": "513226"
                        },
                        "阿坝县": {
                            "code": "513231"
                        },
                        "马尔康市": {
                            "code": "513201"
                        },
                        "黑水县": {
                            "code": "513228"
                        }
                    }
                },
                "雅安市": {
                    "code": "511800",
                    "country": {
                        "名山区": {
                            "code": "511803"
                        },
                        "天全县": {
                            "code": "511825"
                        },
                        "宝兴县": {
                            "code": "511827"
                        },
                        "汉源县": {
                            "code": "511823"
                        },
                        "石棉县": {
                            "code": "511824"
                        },
                        "芦山县": {
                            "code": "511826"
                        },
                        "荥经县": {
                            "code": "511822"
                        },
                        "雨城区": {
                            "code": "511802"
                        }
                    }
                }
            },
            "code": "510000"
        },
        "天津市": {
            "city": {
                "天津市": {
                    "code": "120000",
                    "country": {
                        "东丽区": {
                            "code": "120110"
                        },
                        "北辰区": {
                            "code": "120113"
                        },
                        "南开区": {
                            "code": "120104"
                        },
                        "和平区": {
                            "code": "120101"
                        },
                        "宁河区": {
                            "code": "120117"
                        },
                        "宝坻区": {
                            "code": "120115"
                        },
                        "武清区": {
                            "code": "120114"
                        },
                        "河东区": {
                            "code": "120102"
                        },
                        "河北区": {
                            "code": "120105"
                        },
                        "河西区": {
                            "code": "120103"
                        },
                        "津南区": {
                            "code": "120112"
                        },
                        "滨海新区": {
                            "code": "120116"
                        },
                        "红桥区": {
                            "code": "120106"
                        },
                        "蓟州区": {
                            "code": "120119"
                        },
                        "西青区": {
                            "code": "120111"
                        },
                        "静海区": {
                            "code": "120118"
                        }
                    }
                }
            },
            "code": "120000"
        },
        "宁夏回族自治区": {
            "city": {
                "中卫市": {
                    "code": "640500",
                    "country": {
                        "中宁县": {
                            "code": "640521"
                        },
                        "沙坡头区": {
                            "code": "640502"
                        },
                        "海原县": {
                            "code": "640522"
                        }
                    }
                },
                "吴忠市": {
                    "code": "640300",
                    "country": {
                        "利通区": {
                            "code": "640302"
                        },
                        "同心县": {
                            "code": "640324"
                        },
                        "盐池县": {
                            "code": "640323"
                        },
                        "红寺堡区": {
                            "code": "640303"
                        },
                        "青铜峡市": {
                            "code": "640381"
                        }
                    }
                },
                "固原市": {
                    "code": "640400",
                    "country": {
                        "原州区": {
                            "code": "640402"
                        },
                        "彭阳县": {
                            "code": "640425"
                        },
                        "泾源县": {
                            "code": "640424"
                        },
                        "西吉县": {
                            "code": "640422"
                        },
                        "隆德县": {
                            "code": "640423"
                        }
                    }
                },
                "石嘴山市": {
                    "code": "640200",
                    "country": {
                        "大武口区": {
                            "code": "640202"
                        },
                        "平罗县": {
                            "code": "640221"
                        },
                        "惠农区": {
                            "code": "640205"
                        }
                    }
                },
                "银川市": {
                    "code": "640100",
                    "country": {
                        "兴庆区": {
                            "code": "640104"
                        },
                        "永宁县": {
                            "code": "640121"
                        },
                        "灵武市": {
                            "code": "640181"
                        },
                        "西夏区": {
                            "code": "640105"
                        },
                        "贺兰县": {
                            "code": "640122"
                        },
                        "金凤区": {
                            "code": "640106"
                        }
                    }
                }
            },
            "code": "640000"
        },
        "安徽省": {
            "city": {
                "亳州市": {
                    "code": "341600",
                    "country": {
                        "利辛县": {
                            "code": "341623"
                        },
                        "涡阳县": {
                            "code": "341621"
                        },
                        "蒙城县": {
                            "code": "341622"
                        },
                        "谯城区": {
                            "code": "341602"
                        }
                    }
                },
                "六安市": {
                    "code": "341500",
                    "country": {
                        "叶集区": {
                            "code": "341504"
                        },
                        "舒城县": {
                            "code": "341523"
                        },
                        "裕安区": {
                            "code": "341503"
                        },
                        "金安区": {
                            "code": "341502"
                        },
                        "金寨县": {
                            "code": "341524"
                        },
                        "霍山县": {
                            "code": "341525"
                        },
                        "霍邱县": {
                            "code": "341522"
                        }
                    }
                },
                "合肥市": {
                    "code": "340100",
                    "country": {
                        "包河区": {
                            "code": "340111"
                        },
                        "巢湖市": {
                            "code": "340181"
                        },
                        "庐江县": {
                            "code": "340124"
                        },
                        "庐阳区": {
                            "code": "340103"
                        },
                        "瑶海区": {
                            "code": "340102"
                        },
                        "肥东县": {
                            "code": "340122"
                        },
                        "肥西县": {
                            "code": "340123"
                        },
                        "蜀山区": {
                            "code": "340104"
                        },
                        "长丰县": {
                            "code": "340121"
                        }
                    }
                },
                "安庆市": {
                    "code": "340800",
                    "country": {
                        "大观区": {
                            "code": "340803"
                        },
                        "太湖县": {
                            "code": "340825"
                        },
                        "宜秀区": {
                            "code": "340811"
                        },
                        "宿松县": {
                            "code": "340826"
                        },
                        "岳西县": {
                            "code": "340828"
                        },
                        "怀宁县": {
                            "code": "340822"
                        },
                        "望江县": {
                            "code": "340827"
                        },
                        "桐城市": {
                            "code": "340881"
                        },
                        "潜山市": {
                            "code": "340882"
                        },
                        "迎江区": {
                            "code": "340802"
                        }
                    }
                },
                "宣城市": {
                    "code": "341800",
                    "country": {
                        "宁国市": {
                            "code": "341881"
                        },
                        "宣州区": {
                            "code": "341802"
                        },
                        "广德市": {
                            "code": "341882"
                        },
                        "旌德县": {
                            "code": "341825"
                        },
                        "泾县": {
                            "code": "341823"
                        },
                        "绩溪县": {
                            "code": "341824"
                        },
                        "郎溪县": {
                            "code": "341821"
                        }
                    }
                },
                "宿州市": {
                    "code": "341300",
                    "country": {
                        "埇桥区": {
                            "code": "341302"
                        },
                        "泗县": {
                            "code": "341324"
                        },
                        "灵璧县": {
                            "code": "341323"
                        },
                        "砀山县": {
                            "code": "341321"
                        },
                        "萧县": {
                            "code": "341322"
                        }
                    }
                },
                "池州市": {
                    "code": "341700",
                    "country": {
                        "东至县": {
                            "code": "341721"
                        },
                        "石台县": {
                            "code": "341722"
                        },
                        "贵池区": {
                            "code": "341702"
                        },
                        "青阳县": {
                            "code": "341723"
                        }
                    }
                },
                "淮北市": {
                    "code": "340600",
                    "country": {
                        "杜集区": {
                            "code": "340602"
                        },
                        "濉溪县": {
                            "code": "340621"
                        },
                        "烈山区": {
                            "code": "340604"
                        },
                        "相山区": {
                            "code": "340603"
                        }
                    }
                },
                "淮南市": {
                    "code": "340400",
                    "country": {
                        "八公山区": {
                            "code": "340405"
                        },
                        "凤台县": {
                            "code": "340421"
                        },
                        "大通区": {
                            "code": "340402"
                        },
                        "寿县": {
                            "code": "340422"
                        },
                        "潘集区": {
                            "code": "340406"
                        },
                        "田家庵区": {
                            "code": "340403"
                        },
                        "谢家集区": {
                            "code": "340404"
                        }
                    }
                },
                "滁州市": {
                    "code": "341100",
                    "country": {
                        "全椒县": {
                            "code": "341124"
                        },
                        "凤阳县": {
                            "code": "341126"
                        },
                        "南谯区": {
                            "code": "341103"
                        },
                        "天长市": {
                            "code": "341181"
                        },
                        "定远县": {
                            "code": "341125"
                        },
                        "明光市": {
                            "code": "341182"
                        },
                        "来安县": {
                            "code": "341122"
                        },
                        "琅琊区": {
                            "code": "341102"
                        }
                    }
                },
                "芜湖市": {
                    "code": "340200",
                    "country": {
                        "三山区": {
                            "code": "340208"
                        },
                        "南陵县": {
                            "code": "340223"
                        },
                        "弋江区": {
                            "code": "340203"
                        },
                        "无为市": {
                            "code": "340281"
                        },
                        "繁昌县": {
                            "code": "340222"
                        },
                        "芜湖县": {
                            "code": "340221"
                        },
                        "镜湖区": {
                            "code": "340202"
                        },
                        "鸠江区": {
                            "code": "340207"
                        }
                    }
                },
                "蚌埠市": {
                    "code": "340300",
                    "country": {
                        "五河县": {
                            "code": "340322"
                        },
                        "固镇县": {
                            "code": "340323"
                        },
                        "怀远县": {
                            "code": "340321"
                        },
                        "淮上区": {
                            "code": "340311"
                        },
                        "禹会区": {
                            "code": "340304"
                        },
                        "蚌山区": {
                            "code": "340303"
                        },
                        "龙子湖区": {
                            "code": "340302"
                        }
                    }
                },
                "铜陵市": {
                    "code": "340700",
                    "country": {
                        "义安区": {
                            "code": "340706"
                        },
                        "枞阳县": {
                            "code": "340722"
                        },
                        "郊区": {
                            "code": "340711"
                        },
                        "铜官区": {
                            "code": "340705"
                        }
                    }
                },
                "阜阳市": {
                    "code": "341200",
                    "country": {
                        "临泉县": {
                            "code": "341221"
                        },
                        "太和县": {
                            "code": "341222"
                        },
                        "界首市": {
                            "code": "341282"
                        },
                        "阜南县": {
                            "code": "341225"
                        },
                        "颍上县": {
                            "code": "341226"
                        },
                        "颍东区": {
                            "code": "341203"
                        },
                        "颍州区": {
                            "code": "341202"
                        },
                        "颍泉区": {
                            "code": "341204"
                        }
                    }
                },
                "马鞍山市": {
                    "code": "340500",
                    "country": {
                        "博望区": {
                            "code": "340506"
                        },
                        "含山县": {
                            "code": "340522"
                        },
                        "和县": {
                            "code": "340523"
                        },
                        "当涂县": {
                            "code": "340521"
                        },
                        "花山区": {
                            "code": "340503"
                        },
                        "雨山区": {
                            "code": "340504"
                        }
                    }
                },
                "黄山市": {
                    "code": "341000",
                    "country": {
                        "休宁县": {
                            "code": "341022"
                        },
                        "屯溪区": {
                            "code": "341002"
                        },
                        "徽州区": {
                            "code": "341004"
                        },
                        "歙县": {
                            "code": "341021"
                        },
                        "祁门县": {
                            "code": "341024"
                        },
                        "黄山区": {
                            "code": "341003"
                        },
                        "黟县": {
                            "code": "341023"
                        }
                    }
                }
            },
            "code": "340000"
        },
        "山东省": {
            "city": {
                "东营市": {
                    "code": "370500",
                    "country": {
                        "东营区": {
                            "code": "370502"
                        },
                        "利津县": {
                            "code": "370522"
                        },
                        "垦利区": {
                            "code": "370505"
                        },
                        "广饶县": {
                            "code": "370523"
                        },
                        "河口区": {
                            "code": "370503"
                        }
                    }
                },
                "临沂市": {
                    "code": "371300",
                    "country": {
                        "临沭县": {
                            "code": "371329"
                        },
                        "兰山区": {
                            "code": "371302"
                        },
                        "兰陵县": {
                            "code": "371324"
                        },
                        "平邑县": {
                            "code": "371326"
                        },
                        "沂南县": {
                            "code": "371321"
                        },
                        "沂水县": {
                            "code": "371323"
                        },
                        "河东区": {
                            "code": "371312"
                        },
                        "罗庄区": {
                            "code": "371311"
                        },
                        "莒南县": {
                            "code": "371327"
                        },
                        "蒙阴县": {
                            "code": "371328"
                        },
                        "费县": {
                            "code": "371325"
                        },
                        "郯城县": {
                            "code": "371322"
                        }
                    }
                },
                "威海市": {
                    "code": "371000",
                    "country": {
                        "乳山市": {
                            "code": "371083"
                        },
                        "文登区": {
                            "code": "371003"
                        },
                        "环翠区": {
                            "code": "371002"
                        },
                        "荣成市": {
                            "code": "371082"
                        }
                    }
                },
                "德州市": {
                    "code": "371400",
                    "country": {
                        "临邑县": {
                            "code": "371424"
                        },
                        "乐陵市": {
                            "code": "371481"
                        },
                        "夏津县": {
                            "code": "371427"
                        },
                        "宁津县": {
                            "code": "371422"
                        },
                        "平原县": {
                            "code": "371426"
                        },
                        "庆云县": {
                            "code": "371423"
                        },
                        "德城区": {
                            "code": "371402"
                        },
                        "武城县": {
                            "code": "371428"
                        },
                        "禹城市": {
                            "code": "371482"
                        },
                        "陵城区": {
                            "code": "371403"
                        },
                        "齐河县": {
                            "code": "371425"
                        }
                    }
                },
                "日照市": {
                    "code": "371100",
                    "country": {
                        "东港区": {
                            "code": "371102"
                        },
                        "五莲县": {
                            "code": "371121"
                        },
                        "岚山区": {
                            "code": "371103"
                        },
                        "莒县": {
                            "code": "371122"
                        }
                    }
                },
                "枣庄市": {
                    "code": "370400",
                    "country": {
                        "台儿庄区": {
                            "code": "370405"
                        },
                        "山亭区": {
                            "code": "370406"
                        },
                        "峄城区": {
                            "code": "370404"
                        },
                        "市中区": {
                            "code": "370402"
                        },
                        "滕州市": {
                            "code": "370481"
                        },
                        "薛城区": {
                            "code": "370403"
                        }
                    }
                },
                "泰安市": {
                    "code": "370900",
                    "country": {
                        "东平县": {
                            "code": "370923"
                        },
                        "宁阳县": {
                            "code": "370921"
                        },
                        "岱岳区": {
                            "code": "370911"
                        },
                        "新泰市": {
                            "code": "370982"
                        },
                        "泰山区": {
                            "code": "370902"
                        },
                        "肥城市": {
                            "code": "370983"
                        }
                    }
                },
                "济南市": {
                    "code": "370100",
                    "country": {
                        "历下区": {
                            "code": "370102"
                        },
                        "历城区": {
                            "code": "370112"
                        },
                        "商河县": {
                            "code": "370126"
                        },
                        "天桥区": {
                            "code": "370105"
                        },
                        "市中区": {
                            "code": "370103"
                        },
                        "平阴县": {
                            "code": "370124"
                        },
                        "槐荫区": {
                            "code": "370104"
                        },
                        "济阳区": {
                            "code": "370115"
                        },
                        "章丘区": {
                            "code": "370114"
                        },
                        "莱芜区": {
                            "code": "370116"
                        },
                        "钢城区": {
                            "code": "370117"
                        },
                        "长清区": {
                            "code": "370113"
                        }
                    }
                },
                "济宁市": {
                    "code": "370800",
                    "country": {
                        "任城区": {
                            "code": "370811"
                        },
                        "兖州区": {
                            "code": "370812"
                        },
                        "嘉祥县": {
                            "code": "370829"
                        },
                        "微山县": {
                            "code": "370826"
                        },
                        "曲阜市": {
                            "code": "370881"
                        },
                        "梁山县": {
                            "code": "370832"
                        },
                        "汶上县": {
                            "code": "370830"
                        },
                        "泗水县": {
                            "code": "370831"
                        },
                        "邹城市": {
                            "code": "370883"
                        },
                        "金乡县": {
                            "code": "370828"
                        },
                        "鱼台县": {
                            "code": "370827"
                        }
                    }
                },
                "淄博市": {
                    "code": "370300",
                    "country": {
                        "临淄区": {
                            "code": "370305"
                        },
                        "博山区": {
                            "code": "370304"
                        },
                        "周村区": {
                            "code": "370306"
                        },
                        "张店区": {
                            "code": "370303"
                        },
                        "桓台县": {
                            "code": "370321"
                        },
                        "沂源县": {
                            "code": "370323"
                        },
                        "淄川区": {
                            "code": "370302"
                        },
                        "高青县": {
                            "code": "370322"
                        }
                    }
                },
                "滨州市": {
                    "code": "371600",
                    "country": {
                        "博兴县": {
                            "code": "371625"
                        },
                        "惠民县": {
                            "code": "371621"
                        },
                        "无棣县": {
                            "code": "371623"
                        },
                        "沾化区": {
                            "code": "371603"
                        },
                        "滨城区": {
                            "code": "371602"
                        },
                        "邹平市": {
                            "code": "371681"
                        },
                        "阳信县": {
                            "code": "371622"
                        }
                    }
                },
                "潍坊市": {
                    "code": "370700",
                    "country": {
                        "临朐县": {
                            "code": "370724"
                        },
                        "坊子区": {
                            "code": "370704"
                        },
                        "奎文区": {
                            "code": "370705"
                        },
                        "安丘市": {
                            "code": "370784"
                        },
                        "寒亭区": {
                            "code": "370703"
                        },
                        "寿光市": {
                            "code": "370783"
                        },
                        "昌乐县": {
                            "code": "370725"
                        },
                        "昌邑市": {
                            "code": "370786"
                        },
                        "潍城区": {
                            "code": "370702"
                        },
                        "诸城市": {
                            "code": "370782"
                        },
                        "青州市": {
                            "code": "370781"
                        },
                        "高密市": {
                            "code": "370785"
                        }
                    }
                },
                "烟台市": {
                    "code": "370600",
                    "country": {
                        "招远市": {
                            "code": "370685"
                        },
                        "栖霞市": {
                            "code": "370686"
                        },
                        "海阳市": {
                            "code": "370687"
                        },
                        "牟平区": {
                            "code": "370612"
                        },
                        "福山区": {
                            "code": "370611"
                        },
                        "芝罘区": {
                            "code": "370602"
                        },
                        "莱山区": {
                            "code": "370613"
                        },
                        "莱州市": {
                            "code": "370683"
                        },
                        "莱阳市": {
                            "code": "370682"
                        },
                        "蓬莱市": {
                            "code": "370684"
                        },
                        "长岛县": {
                            "code": "370634"
                        },
                        "龙口市": {
                            "code": "370681"
                        }
                    }
                },
                "聊城市": {
                    "code": "371500",
                    "country": {
                        "东昌府区": {
                            "code": "371502"
                        },
                        "东阿县": {
                            "code": "371524"
                        },
                        "临清市": {
                            "code": "371581"
                        },
                        "冠县": {
                            "code": "371525"
                        },
                        "茌平区": {
                            "code": "371503"
                        },
                        "莘县": {
                            "code": "371522"
                        },
                        "阳谷县": {
                            "code": "371521"
                        },
                        "高唐县": {
                            "code": "371526"
                        }
                    }
                },
                "菏泽市": {
                    "code": "371700",
                    "country": {
                        "东明县": {
                            "code": "371728"
                        },
                        "单县": {
                            "code": "371722"
                        },
                        "定陶区": {
                            "code": "371703"
                        },
                        "巨野县": {
                            "code": "371724"
                        },
                        "成武县": {
                            "code": "371723"
                        },
                        "曹县": {
                            "code": "371721"
                        },
                        "牡丹区": {
                            "code": "371702"
                        },
                        "郓城县": {
                            "code": "371725"
                        },
                        "鄄城县": {
                            "code": "371726"
                        }
                    }
                },
                "青岛市": {
                    "code": "370200",
                    "country": {
                        "即墨区": {
                            "code": "370215"
                        },
                        "城阳区": {
                            "code": "370214"
                        },
                        "崂山区": {
                            "code": "370212"
                        },
                        "市北区": {
                            "code": "370203"
                        },
                        "市南区": {
                            "code": "370202"
                        },
                        "平度市": {
                            "code": "370283"
                        },
                        "李沧区": {
                            "code": "370213"
                        },
                        "胶州市": {
                            "code": "370281"
                        },
                        "莱西市": {
                            "code": "370285"
                        },
                        "黄岛区": {
                            "code": "370211"
                        }
                    }
                }
            },
            "code": "370000"
        },
        "山西省": {
            "city": {
                "临汾市": {
                    "code": "141000",
                    "country": {
                        "乡宁县": {
                            "code": "141029"
                        },
                        "侯马市": {
                            "code": "141081"
                        },
                        "古县": {
                            "code": "141025"
                        },
                        "吉县": {
                            "code": "141028"
                        },
                        "大宁县": {
                            "code": "141030"
                        },
                        "安泽县": {
                            "code": "141026"
                        },
                        "尧都区": {
                            "code": "141002"
                        },
                        "曲沃县": {
                            "code": "141021"
                        },
                        "永和县": {
                            "code": "141032"
                        },
                        "汾西县": {
                            "code": "141034"
                        },
                        "洪洞县": {
                            "code": "141024"
                        },
                        "浮山县": {
                            "code": "141027"
                        },
                        "翼城县": {
                            "code": "141022"
                        },
                        "蒲县": {
                            "code": "141033"
                        },
                        "襄汾县": {
                            "code": "141023"
                        },
                        "隰县": {
                            "code": "141031"
                        },
                        "霍州市": {
                            "code": "141082"
                        }
                    }
                },
                "吕梁市": {
                    "code": "141100",
                    "country": {
                        "中阳县": {
                            "code": "141129"
                        },
                        "临县": {
                            "code": "141124"
                        },
                        "交口县": {
                            "code": "141130"
                        },
                        "交城县": {
                            "code": "141122"
                        },
                        "兴县": {
                            "code": "141123"
                        },
                        "孝义市": {
                            "code": "141181"
                        },
                        "岚县": {
                            "code": "141127"
                        },
                        "文水县": {
                            "code": "141121"
                        },
                        "方山县": {
                            "code": "141128"
                        },
                        "柳林县": {
                            "code": "141125"
                        },
                        "汾阳市": {
                            "code": "141182"
                        },
                        "石楼县": {
                            "code": "141126"
                        },
                        "离石区": {
                            "code": "141102"
                        }
                    }
                },
                "大同市": {
                    "code": "140200",
                    "country": {
                        "云冈区": {
                            "code": "140214"
                        },
                        "云州区": {
                            "code": "140215"
                        },
                        "天镇县": {
                            "code": "140222"
                        },
                        "左云县": {
                            "code": "140226"
                        },
                        "平城区": {
                            "code": "140213"
                        },
                        "广灵县": {
                            "code": "140223"
                        },
                        "新荣区": {
                            "code": "140212"
                        },
                        "浑源县": {
                            "code": "140225"
                        },
                        "灵丘县": {
                            "code": "140224"
                        },
                        "阳高县": {
                            "code": "140221"
                        }
                    }
                },
                "太原市": {
                    "code": "140100",
                    "country": {
                        "万柏林区": {
                            "code": "140109"
                        },
                        "古交市": {
                            "code": "140181"
                        },
                        "娄烦县": {
                            "code": "140123"
                        },
                        "小店区": {
                            "code": "140105"
                        },
                        "尖草坪区": {
                            "code": "140108"
                        },
                        "晋源区": {
                            "code": "140110"
                        },
                        "杏花岭区": {
                            "code": "140107"
                        },
                        "清徐县": {
                            "code": "140121"
                        },
                        "迎泽区": {
                            "code": "140106"
                        },
                        "阳曲县": {
                            "code": "140122"
                        }
                    }
                },
                "忻州市": {
                    "code": "140900",
                    "country": {
                        "五台县": {
                            "code": "140922"
                        },
                        "五寨县": {
                            "code": "140928"
                        },
                        "代县": {
                            "code": "140923"
                        },
                        "保德县": {
                            "code": "140931"
                        },
                        "偏关县": {
                            "code": "140932"
                        },
                        "原平市": {
                            "code": "140981"
                        },
                        "宁武县": {
                            "code": "140925"
                        },
                        "定襄县": {
                            "code": "140921"
                        },
                        "岢岚县": {
                            "code": "140929"
                        },
                        "忻府区": {
                            "code": "140902"
                        },
                        "河曲县": {
                            "code": "140930"
                        },
                        "神池县": {
                            "code": "140927"
                        },
                        "繁峙县": {
                            "code": "140924"
                        },
                        "静乐县": {
                            "code": "140926"
                        }
                    }
                },
                "晋中市": {
                    "code": "140700",
                    "country": {
                        "介休市": {
                            "code": "140781"
                        },
                        "和顺县": {
                            "code": "140723"
                        },
                        "太谷区": {
                            "code": "140703"
                        },
                        "寿阳县": {
                            "code": "140725"
                        },
                        "左权县": {
                            "code": "140722"
                        },
                        "平遥县": {
                            "code": "140728"
                        },
                        "昔阳县": {
                            "code": "140724"
                        },
                        "榆次区": {
                            "code": "140702"
                        },
                        "榆社县": {
                            "code": "140721"
                        },
                        "灵石县": {
                            "code": "140729"
                        },
                        "祁县": {
                            "code": "140727"
                        }
                    }
                },
                "晋城市": {
                    "code": "140500",
                    "country": {
                        "城区": {
                            "code": "140502"
                        },
                        "沁水县": {
                            "code": "140521"
                        },
                        "泽州县": {
                            "code": "140525"
                        },
                        "阳城县": {
                            "code": "140522"
                        },
                        "陵川县": {
                            "code": "140524"
                        },
                        "高平市": {
                            "code": "140581"
                        }
                    }
                },
                "朔州市": {
                    "code": "140600",
                    "country": {
                        "右玉县": {
                            "code": "140623"
                        },
                        "山阴县": {
                            "code": "140621"
                        },
                        "平鲁区": {
                            "code": "140603"
                        },
                        "应县": {
                            "code": "140622"
                        },
                        "怀仁市": {
                            "code": "140681"
                        },
                        "朔城区": {
                            "code": "140602"
                        }
                    }
                },
                "运城市": {
                    "code": "140800",
                    "country": {
                        "万荣县": {
                            "code": "140822"
                        },
                        "临猗县": {
                            "code": "140821"
                        },
                        "垣曲县": {
                            "code": "140827"
                        },
                        "夏县": {
                            "code": "140828"
                        },
                        "平陆县": {
                            "code": "140829"
                        },
                        "新绛县": {
                            "code": "140825"
                        },
                        "永济市": {
                            "code": "140881"
                        },
                        "河津市": {
                            "code": "140882"
                        },
                        "盐湖区": {
                            "code": "140802"
                        },
                        "稷山县": {
                            "code": "140824"
                        },
                        "绛县": {
                            "code": "140826"
                        },
                        "芮城县": {
                            "code": "140830"
                        },
                        "闻喜县": {
                            "code": "140823"
                        }
                    }
                },
                "长治市": {
                    "code": "140400",
                    "country": {
                        "上党区": {
                            "code": "140404"
                        },
                        "壶关县": {
                            "code": "140427"
                        },
                        "屯留区": {
                            "code": "140405"
                        },
                        "平顺县": {
                            "code": "140425"
                        },
                        "武乡县": {
                            "code": "140429"
                        },
                        "沁县": {
                            "code": "140430"
                        },
                        "沁源县": {
                            "code": "140431"
                        },
                        "潞城区": {
                            "code": "140406"
                        },
                        "潞州区": {
                            "code": "140403"
                        },
                        "襄垣县": {
                            "code": "140423"
                        },
                        "长子县": {
                            "code": "140428"
                        },
                        "黎城县": {
                            "code": "140426"
                        }
                    }
                },
                "阳泉市": {
                    "code": "140300",
                    "country": {
                        "城区": {
                            "code": "140302"
                        },
                        "平定县": {
                            "code": "140321"
                        },
                        "盂县": {
                            "code": "140322"
                        },
                        "矿区": {
                            "code": "140303"
                        },
                        "郊区": {
                            "code": "140311"
                        }
                    }
                }
            },
            "code": "140000"
        },
        "广东省": {
            "city": {
                "东莞市": {
                    "code": "441900",
                    "country": {}
                },
                "中山市": {
                    "code": "442000",
                    "country": {}
                },
                "云浮市": {
                    "code": "445300",
                    "country": {
                        "云城区": {
                            "code": "445302"
                        },
                        "云安区": {
                            "code": "445303"
                        },
                        "新兴县": {
                            "code": "445321"
                        },
                        "罗定市": {
                            "code": "445381"
                        },
                        "郁南县": {
                            "code": "445322"
                        }
                    }
                },
                "佛山市": {
                    "code": "440600",
                    "country": {
                        "三水区": {
                            "code": "440607"
                        },
                        "南海区": {
                            "code": "440605"
                        },
                        "禅城区": {
                            "code": "440604"
                        },
                        "顺德区": {
                            "code": "440606"
                        },
                        "高明区": {
                            "code": "440608"
                        }
                    }
                },
                "广州市": {
                    "code": "440100",
                    "country": {
                        "从化区": {
                            "code": "440117"
                        },
                        "南沙区": {
                            "code": "440115"
                        },
                        "增城区": {
                            "code": "440118"
                        },
                        "天河区": {
                            "code": "440106"
                        },
                        "海珠区": {
                            "code": "440105"
                        },
                        "番禺区": {
                            "code": "440113"
                        },
                        "白云区": {
                            "code": "440111"
                        },
                        "花都区": {
                            "code": "440114"
                        },
                        "荔湾区": {
                            "code": "440103"
                        },
                        "越秀区": {
                            "code": "440104"
                        },
                        "黄埔区": {
                            "code": "440112"
                        }
                    }
                },
                "惠州市": {
                    "code": "441300",
                    "country": {
                        "博罗县": {
                            "code": "441322"
                        },
                        "惠东县": {
                            "code": "441323"
                        },
                        "惠城区": {
                            "code": "441302"
                        },
                        "惠阳区": {
                            "code": "441303"
                        },
                        "龙门县": {
                            "code": "441324"
                        }
                    }
                },
                "揭阳市": {
                    "code": "445200",
                    "country": {
                        "惠来县": {
                            "code": "445224"
                        },
                        "揭东区": {
                            "code": "445203"
                        },
                        "揭西县": {
                            "code": "445222"
                        },
                        "普宁市": {
                            "code": "445281"
                        },
                        "榕城区": {
                            "code": "445202"
                        }
                    }
                },
                "梅州市": {
                    "code": "441400",
                    "country": {
                        "丰顺县": {
                            "code": "441423"
                        },
                        "五华县": {
                            "code": "441424"
                        },
                        "兴宁市": {
                            "code": "441481"
                        },
                        "大埔县": {
                            "code": "441422"
                        },
                        "平远县": {
                            "code": "441426"
                        },
                        "梅县区": {
                            "code": "441403"
                        },
                        "梅江区": {
                            "code": "441402"
                        },
                        "蕉岭县": {
                            "code": "441427"
                        }
                    }
                },
                "汕头市": {
                    "code": "440500",
                    "country": {
                        "南澳县": {
                            "code": "440523"
                        },
                        "潮南区": {
                            "code": "440514"
                        },
                        "潮阳区": {
                            "code": "440513"
                        },
                        "澄海区": {
                            "code": "440515"
                        },
                        "濠江区": {
                            "code": "440512"
                        },
                        "金平区": {
                            "code": "440511"
                        },
                        "龙湖区": {
                            "code": "440507"
                        }
                    }
                },
                "汕尾市": {
                    "code": "441500",
                    "country": {
                        "城区": {
                            "code": "441502"
                        },
                        "海丰县": {
                            "code": "441521"
                        },
                        "陆丰市": {
                            "code": "441581"
                        },
                        "陆河县": {
                            "code": "441523"
                        }
                    }
                },
                "江门市": {
                    "code": "440700",
                    "country": {
                        "台山市": {
                            "code": "440781"
                        },
                        "开平市": {
                            "code": "440783"
                        },
                        "恩平市": {
                            "code": "440785"
                        },
                        "新会区": {
                            "code": "440705"
                        },
                        "江海区": {
                            "code": "440704"
                        },
                        "蓬江区": {
                            "code": "440703"
                        },
                        "鹤山市": {
                            "code": "440784"
                        }
                    }
                },
                "河源市": {
                    "code": "441600",
                    "country": {
                        "东源县": {
                            "code": "441625"
                        },
                        "和平县": {
                            "code": "441624"
                        },
                        "源城区": {
                            "code": "441602"
                        },
                        "紫金县": {
                            "code": "441621"
                        },
                        "连平县": {
                            "code": "441623"
                        },
                        "龙川县": {
                            "code": "441622"
                        }
                    }
                },
                "深圳市": {
                    "code": "440300",
                    "country": {
                        "光明区": {
                            "code": "440311"
                        },
                        "南山区": {
                            "code": "440305"
                        },
                        "坪山区": {
                            "code": "440310"
                        },
                        "宝安区": {
                            "code": "440306"
                        },
                        "盐田区": {
                            "code": "440308"
                        },
                        "福田区": {
                            "code": "440304"
                        },
                        "罗湖区": {
                            "code": "440303"
                        },
                        "龙华区": {
                            "code": "440309"
                        },
                        "龙岗区": {
                            "code": "440307"
                        }
                    }
                },
                "清远市": {
                    "code": "441800",
                    "country": {
                        "佛冈县": {
                            "code": "441821"
                        },
                        "清城区": {
                            "code": "441802"
                        },
                        "清新区": {
                            "code": "441803"
                        },
                        "英德市": {
                            "code": "441881"
                        },
                        "连南瑶族自治县": {
                            "code": "441826"
                        },
                        "连山壮族瑶族自治县": {
                            "code": "441825"
                        },
                        "连州市": {
                            "code": "441882"
                        },
                        "阳山县": {
                            "code": "441823"
                        }
                    }
                },
                "湛江市": {
                    "code": "440800",
                    "country": {
                        "吴川市": {
                            "code": "440883"
                        },
                        "坡头区": {
                            "code": "440804"
                        },
                        "廉江市": {
                            "code": "440881"
                        },
                        "徐闻县": {
                            "code": "440825"
                        },
                        "赤坎区": {
                            "code": "440802"
                        },
                        "遂溪县": {
                            "code": "440823"
                        },
                        "雷州市": {
                            "code": "440882"
                        },
                        "霞山区": {
                            "code": "440803"
                        },
                        "麻章区": {
                            "code": "440811"
                        }
                    }
                },
                "潮州市": {
                    "code": "445100",
                    "country": {
                        "湘桥区": {
                            "code": "445102"
                        },
                        "潮安区": {
                            "code": "445103"
                        },
                        "饶平县": {
                            "code": "445122"
                        }
                    }
                },
                "珠海市": {
                    "code": "440400",
                    "country": {
                        "斗门区": {
                            "code": "440403"
                        },
                        "金湾区": {
                            "code": "440404"
                        },
                        "香洲区": {
                            "code": "440402"
                        }
                    }
                },
                "肇庆市": {
                    "code": "441200",
                    "country": {
                        "四会市": {
                            "code": "441284"
                        },
                        "封开县": {
                            "code": "441225"
                        },
                        "广宁县": {
                            "code": "441223"
                        },
                        "德庆县": {
                            "code": "441226"
                        },
                        "怀集县": {
                            "code": "441224"
                        },
                        "端州区": {
                            "code": "441202"
                        },
                        "高要区": {
                            "code": "441204"
                        },
                        "鼎湖区": {
                            "code": "441203"
                        }
                    }
                },
                "茂名市": {
                    "code": "440900",
                    "country": {
                        "信宜市": {
                            "code": "440983"
                        },
                        "化州市": {
                            "code": "440982"
                        },
                        "电白区": {
                            "code": "440904"
                        },
                        "茂南区": {
                            "code": "440902"
                        },
                        "高州市": {
                            "code": "440981"
                        }
                    }
                },
                "阳江市": {
                    "code": "441700",
                    "country": {
                        "江城区": {
                            "code": "441702"
                        },
                        "阳东区": {
                            "code": "441704"
                        },
                        "阳春市": {
                            "code": "441781"
                        },
                        "阳西县": {
                            "code": "441721"
                        }
                    }
                },
                "韶关市": {
                    "code": "440200",
                    "country": {
                        "乐昌市": {
                            "code": "440281"
                        },
                        "乳源瑶族自治县": {
                            "code": "440232"
                        },
                        "仁化县": {
                            "code": "440224"
                        },
                        "南雄市": {
                            "code": "440282"
                        },
                        "始兴县": {
                            "code": "440222"
                        },
                        "新丰县": {
                            "code": "440233"
                        },
                        "曲江区": {
                            "code": "440205"
                        },
                        "武江区": {
                            "code": "440203"
                        },
                        "浈江区": {
                            "code": "440204"
                        },
                        "翁源县": {
                            "code": "440229"
                        }
                    }
                }
            },
            "code": "440000"
        },
        "广西壮族自治区": {
            "city": {
                "北海市": {
                    "code": "450500",
                    "country": {
                        "合浦县": {
                            "code": "450521"
                        },
                        "海城区": {
                            "code": "450502"
                        },
                        "铁山港区": {
                            "code": "450512"
                        },
                        "银海区": {
                            "code": "450503"
                        }
                    }
                },
                "南宁市": {
                    "code": "450100",
                    "country": {
                        "上林县": {
                            "code": "450125"
                        },
                        "兴宁区": {
                            "code": "450102"
                        },
                        "宾阳县": {
                            "code": "450126"
                        },
                        "横县": {
                            "code": "450127"
                        },
                        "武鸣区": {
                            "code": "450110"
                        },
                        "江南区": {
                            "code": "450105"
                        },
                        "良庆区": {
                            "code": "450108"
                        },
                        "西乡塘区": {
                            "code": "450107"
                        },
                        "邕宁区": {
                            "code": "450109"
                        },
                        "隆安县": {
                            "code": "450123"
                        },
                        "青秀区": {
                            "code": "450103"
                        },
                        "马山县": {
                            "code": "450124"
                        }
                    }
                },
                "崇左市": {
                    "code": "451400",
                    "country": {
                        "凭祥市": {
                            "code": "451481"
                        },
                        "大新县": {
                            "code": "451424"
                        },
                        "天等县": {
                            "code": "451425"
                        },
                        "宁明县": {
                            "code": "451422"
                        },
                        "扶绥县": {
                            "code": "451421"
                        },
                        "江州区": {
                            "code": "451402"
                        },
                        "龙州县": {
                            "code": "451423"
                        }
                    }
                },
                "来宾市": {
                    "code": "451300",
                    "country": {
                        "兴宾区": {
                            "code": "451302"
                        },
                        "合山市": {
                            "code": "451381"
                        },
                        "忻城县": {
                            "code": "451321"
                        },
                        "武宣县": {
                            "code": "451323"
                        },
                        "象州县": {
                            "code": "451322"
                        },
                        "金秀瑶族自治县": {
                            "code": "451324"
                        }
                    }
                },
                "柳州市": {
                    "code": "450200",
                    "country": {
                        "三江侗族自治县": {
                            "code": "450226"
                        },
                        "城中区": {
                            "code": "450202"
                        },
                        "柳北区": {
                            "code": "450205"
                        },
                        "柳南区": {
                            "code": "450204"
                        },
                        "柳城县": {
                            "code": "450222"
                        },
                        "柳江区": {
                            "code": "450206"
                        },
                        "融安县": {
                            "code": "450224"
                        },
                        "融水苗族自治县": {
                            "code": "450225"
                        },
                        "鱼峰区": {
                            "code": "450203"
                        },
                        "鹿寨县": {
                            "code": "450223"
                        }
                    }
                },
                "桂林市": {
                    "code": "450300",
                    "country": {
                        "七星区": {
                            "code": "450305"
                        },
                        "临桂区": {
                            "code": "450312"
                        },
                        "全州县": {
                            "code": "450324"
                        },
                        "兴安县": {
                            "code": "450325"
                        },
                        "叠彩区": {
                            "code": "450303"
                        },
                        "平乐县": {
                            "code": "450330"
                        },
                        "恭城瑶族自治县": {
                            "code": "450332"
                        },
                        "永福县": {
                            "code": "450326"
                        },
                        "灌阳县": {
                            "code": "450327"
                        },
                        "灵川县": {
                            "code": "450323"
                        },
                        "秀峰区": {
                            "code": "450302"
                        },
                        "荔浦市": {
                            "code": "450381"
                        },
                        "象山区": {
                            "code": "450304"
                        },
                        "资源县": {
                            "code": "450329"
                        },
                        "阳朔县": {
                            "code": "450321"
                        },
                        "雁山区": {
                            "code": "450311"
                        },
                        "龙胜各族自治县": {
                            "code": "450328"
                        }
                    }
                },
                "梧州市": {
                    "code": "450400",
                    "country": {
                        "万秀区": {
                            "code": "450403"
                        },
                        "岑溪市": {
                            "code": "450481"
                        },
                        "苍梧县": {
                            "code": "450421"
                        },
                        "蒙山县": {
                            "code": "450423"
                        },
                        "藤县": {
                            "code": "450422"
                        },
                        "长洲区": {
                            "code": "450405"
                        },
                        "龙圩区": {
                            "code": "450406"
                        }
                    }
                },
                "河池市": {
                    "code": "451200",
                    "country": {
                        "东兰县": {
                            "code": "451224"
                        },
                        "凤山县": {
                            "code": "451223"
                        },
                        "南丹县": {
                            "code": "451221"
                        },
                        "大化瑶族自治县": {
                            "code": "451229"
                        },
                        "天峨县": {
                            "code": "451222"
                        },
                        "宜州区": {
                            "code": "451203"
                        },
                        "巴马瑶族自治县": {
                            "code": "451227"
                        },
                        "环江毛南族自治县": {
                            "code": "451226"
                        },
                        "罗城仫佬族自治县": {
                            "code": "451225"
                        },
                        "都安瑶族自治县": {
                            "code": "451228"
                        },
                        "金城江区": {
                            "code": "451202"
                        }
                    }
                },
                "玉林市": {
                    "code": "450900",
                    "country": {
                        "兴业县": {
                            "code": "450924"
                        },
                        "北流市": {
                            "code": "450981"
                        },
                        "博白县": {
                            "code": "450923"
                        },
                        "容县": {
                            "code": "450921"
                        },
                        "玉州区": {
                            "code": "450902"
                        },
                        "福绵区": {
                            "code": "450903"
                        },
                        "陆川县": {
                            "code": "450922"
                        }
                    }
                },
                "百色市": {
                    "code": "451000",
                    "country": {
                        "乐业县": {
                            "code": "451028"
                        },
                        "凌云县": {
                            "code": "451027"
                        },
                        "右江区": {
                            "code": "451002"
                        },
                        "平果市": {
                            "code": "451082"
                        },
                        "德保县": {
                            "code": "451024"
                        },
                        "田东县": {
                            "code": "451022"
                        },
                        "田林县": {
                            "code": "451029"
                        },
                        "田阳区": {
                            "code": "451003"
                        },
                        "西林县": {
                            "code": "451030"
                        },
                        "那坡县": {
                            "code": "451026"
                        },
                        "隆林各族自治县": {
                            "code": "451031"
                        },
                        "靖西市": {
                            "code": "451081"
                        }
                    }
                },
                "贵港市": {
                    "code": "450800",
                    "country": {
                        "平南县": {
                            "code": "450821"
                        },
                        "桂平市": {
                            "code": "450881"
                        },
                        "港北区": {
                            "code": "450802"
                        },
                        "港南区": {
                            "code": "450803"
                        },
                        "覃塘区": {
                            "code": "450804"
                        }
                    }
                },
                "贺州市": {
                    "code": "451100",
                    "country": {
                        "八步区": {
                            "code": "451102"
                        },
                        "富川瑶族自治县": {
                            "code": "451123"
                        },
                        "平桂区": {
                            "code": "451103"
                        },
                        "昭平县": {
                            "code": "451121"
                        },
                        "钟山县": {
                            "code": "451122"
                        }
                    }
                },
                "钦州市": {
                    "code": "450700",
                    "country": {
                        "浦北县": {
                            "code": "450722"
                        },
                        "灵山县": {
                            "code": "450721"
                        },
                        "钦北区": {
                            "code": "450703"
                        },
                        "钦南区": {
                            "code": "450702"
                        }
                    }
                },
                "防城港市": {
                    "code": "450600",
                    "country": {
                        "上思县": {
                            "code": "450621"
                        },
                        "东兴市": {
                            "code": "450681"
                        },
                        "港口区": {
                            "code": "450602"
                        },
                        "防城区": {
                            "code": "450603"
                        }
                    }
                }
            },
            "code": "450000"
        },
        "新疆维吾尔自治区": {
            "city": {
                "乌鲁木齐市": {
                    "code": "650100",
                    "country": {
                        "乌鲁木齐县": {
                            "code": "650121"
                        },
                        "天山区": {
                            "code": "650102"
                        },
                        "头屯河区": {
                            "code": "650106"
                        },
                        "新市区": {
                            "code": "650104"
                        },
                        "水磨沟区": {
                            "code": "650105"
                        },
                        "沙依巴克区": {
                            "code": "650103"
                        },
                        "米东区": {
                            "code": "650109"
                        },
                        "达坂城区": {
                            "code": "650107"
                        }
                    }
                },
                "伊犁哈萨克自治州☆": {
                    "code": "654000",
                    "country": {
                        "伊宁县": {
                            "code": "654021"
                        },
                        "伊宁市": {
                            "code": "654002"
                        },
                        "奎屯市": {
                            "code": "654003"
                        },
                        "察布查尔锡伯自治县": {
                            "code": "654022"
                        },
                        "尼勒克县": {
                            "code": "654028"
                        },
                        "巩留县": {
                            "code": "654024"
                        },
                        "新源县": {
                            "code": "654025"
                        },
                        "昭苏县": {
                            "code": "654026"
                        },
                        "特克斯县": {
                            "code": "654027"
                        },
                        "霍城县": {
                            "code": "654023"
                        },
                        "霍尔果斯市": {
                            "code": "654004"
                        }
                    }
                },
                "克孜勒苏柯尔克孜自治州": {
                    "code": "653000",
                    "country": {
                        "乌恰县": {
                            "code": "653024"
                        },
                        "阿克陶县": {
                            "code": "653022"
                        },
                        "阿合奇县": {
                            "code": "653023"
                        },
                        "阿图什市": {
                            "code": "653001"
                        }
                    }
                },
                "克拉玛依市": {
                    "code": "650200",
                    "country": {
                        "乌尔禾区": {
                            "code": "650205"
                        },
                        "克拉玛依区": {
                            "code": "650203"
                        },
                        "独山子区": {
                            "code": "650202"
                        },
                        "白碱滩区": {
                            "code": "650204"
                        }
                    }
                },
                "博尔塔拉蒙古自治州": {
                    "code": "652700",
                    "country": {
                        "博乐市": {
                            "code": "652701"
                        },
                        "温泉县": {
                            "code": "652723"
                        },
                        "精河县": {
                            "code": "652722"
                        },
                        "阿拉山口市": {
                            "code": "652702"
                        }
                    }
                },
                "吐鲁番市": {
                    "code": "650400",
                    "country": {
                        "托克逊县": {
                            "code": "650422"
                        },
                        "鄯善县": {
                            "code": "650421"
                        },
                        "高昌区": {
                            "code": "650402"
                        }
                    }
                },
                "和田地区": {
                    "code": "653200",
                    "country": {
                        "于田县": {
                            "code": "653226"
                        },
                        "和田县": {
                            "code": "653221"
                        },
                        "和田市": {
                            "code": "653201"
                        },
                        "墨玉县": {
                            "code": "653222"
                        },
                        "民丰县": {
                            "code": "653227"
                        },
                        "洛浦县": {
                            "code": "653224"
                        },
                        "皮山县": {
                            "code": "653223"
                        },
                        "策勒县": {
                            "code": "653225"
                        }
                    }
                },
                "哈密市": {
                    "code": "650500",
                    "country": {
                        "伊吾县": {
                            "code": "650522"
                        },
                        "伊州区": {
                            "code": "650502"
                        },
                        "巴里坤哈萨克自治县": {
                            "code": "650521"
                        }
                    }
                },
                "喀什地区": {
                    "code": "653100",
                    "country": {
                        "伽师县": {
                            "code": "653129"
                        },
                        "叶城县": {
                            "code": "653126"
                        },
                        "喀什市": {
                            "code": "653101"
                        },
                        "塔什库尔干塔吉克自治县": {
                            "code": "653131"
                        },
                        "岳普湖县": {
                            "code": "653128"
                        },
                        "巴楚县": {
                            "code": "653130"
                        },
                        "泽普县": {
                            "code": "653124"
                        },
                        "疏勒县": {
                            "code": "653122"
                        },
                        "疏附县": {
                            "code": "653121"
                        },
                        "英吉沙县": {
                            "code": "653123"
                        },
                        "莎车县": {
                            "code": "653125"
                        },
                        "麦盖提县": {
                            "code": "653127"
                        }
                    }
                },
                "塔城地区": {
                    "code": "654200",
                    "country": {
                        "乌苏市": {
                            "code": "654202"
                        },
                        "和布克赛尔蒙古自治县": {
                            "code": "654226"
                        },
                        "塔城市": {
                            "code": "654201"
                        },
                        "托里县": {
                            "code": "654224"
                        },
                        "沙湾县": {
                            "code": "654223"
                        },
                        "裕民县": {
                            "code": "654225"
                        },
                        "额敏县": {
                            "code": "654221"
                        }
                    }
                },
                "巴音郭楞蒙古自治州": {
                    "code": "652800",
                    "country": {
                        "且末县": {
                            "code": "652825"
                        },
                        "博湖县": {
                            "code": "652829"
                        },
                        "和硕县": {
                            "code": "652828"
                        },
                        "和静县": {
                            "code": "652827"
                        },
                        "尉犁县": {
                            "code": "652823"
                        },
                        "库尔勒市": {
                            "code": "652801"
                        },
                        "焉耆回族自治县": {
                            "code": "652826"
                        },
                        "若羌县": {
                            "code": "652824"
                        },
                        "轮台县": {
                            "code": "652822"
                        }
                    }
                },
                "昌吉回族自治州": {
                    "code": "652300",
                    "country": {
                        "吉木萨尔县": {
                            "code": "652327"
                        },
                        "呼图壁县": {
                            "code": "652323"
                        },
                        "奇台县": {
                            "code": "652325"
                        },
                        "昌吉市": {
                            "code": "652301"
                        },
                        "木垒哈萨克自治县": {
                            "code": "652328"
                        },
                        "玛纳斯县": {
                            "code": "652324"
                        },
                        "阜康市": {
                            "code": "652302"
                        }
                    }
                },
                "阿克苏地区": {
                    "code": "652900",
                    "country": {
                        "乌什县": {
                            "code": "652927"
                        },
                        "库车市": {
                            "code": "652902"
                        },
                        "拜城县": {
                            "code": "652926"
                        },
                        "新和县": {
                            "code": "652925"
                        },
                        "柯坪县": {
                            "code": "652929"
                        },
                        "沙雅县": {
                            "code": "652924"
                        },
                        "温宿县": {
                            "code": "652922"
                        },
                        "阿克苏市": {
                            "code": "652901"
                        },
                        "阿瓦提县": {
                            "code": "652928"
                        }
                    }
                },
                "阿勒泰地区": {
                    "code": "654300",
                    "country": {
                        "吉木乃县": {
                            "code": "654326"
                        },
                        "哈巴河县": {
                            "code": "654324"
                        },
                        "富蕴县": {
                            "code": "654322"
                        },
                        "布尔津县": {
                            "code": "654321"
                        },
                        "福海县": {
                            "code": "654323"
                        },
                        "阿勒泰市": {
                            "code": "654301"
                        },
                        "青河县": {
                            "code": "654325"
                        }
                    }
                }
            },
            "code": "650000"
        },
        "江苏省": {
            "city": {
                "南京市": {
                    "code": "320100",
                    "country": {
                        "六合区": {
                            "code": "320116"
                        },
                        "建邺区": {
                            "code": "320105"
                        },
                        "栖霞区": {
                            "code": "320113"
                        },
                        "江宁区": {
                            "code": "320115"
                        },
                        "浦口区": {
                            "code": "320111"
                        },
                        "溧水区": {
                            "code": "320117"
                        },
                        "玄武区": {
                            "code": "320102"
                        },
                        "秦淮区": {
                            "code": "320104"
                        },
                        "雨花台区": {
                            "code": "320114"
                        },
                        "高淳区": {
                            "code": "320118"
                        },
                        "鼓楼区": {
                            "code": "320106"
                        }
                    }
                },
                "南通市": {
                    "code": "320600",
                    "country": {
                        "启东市": {
                            "code": "320681"
                        },
                        "如东县": {
                            "code": "320623"
                        },
                        "如皋市": {
                            "code": "320682"
                        },
                        "崇川区": {
                            "code": "320602"
                        },
                        "海安市": {
                            "code": "320685"
                        },
                        "海门市": {
                            "code": "320684"
                        },
                        "港闸区": {
                            "code": "320611"
                        },
                        "通州区": {
                            "code": "320612"
                        }
                    }
                },
                "宿迁市": {
                    "code": "321300",
                    "country": {
                        "宿城区": {
                            "code": "321302"
                        },
                        "宿豫区": {
                            "code": "321311"
                        },
                        "沭阳县": {
                            "code": "321322"
                        },
                        "泗洪县": {
                            "code": "321324"
                        },
                        "泗阳县": {
                            "code": "321323"
                        }
                    }
                },
                "常州市": {
                    "code": "320400",
                    "country": {
                        "天宁区": {
                            "code": "320402"
                        },
                        "新北区": {
                            "code": "320411"
                        },
                        "武进区": {
                            "code": "320412"
                        },
                        "溧阳市": {
                            "code": "320481"
                        },
                        "金坛区": {
                            "code": "320413"
                        },
                        "钟楼区": {
                            "code": "320404"
                        }
                    }
                },
                "徐州市": {
                    "code": "320300",
                    "country": {
                        "丰县": {
                            "code": "320321"
                        },
                        "云龙区": {
                            "code": "320303"
                        },
                        "新沂市": {
                            "code": "320381"
                        },
                        "沛县": {
                            "code": "320322"
                        },
                        "泉山区": {
                            "code": "320311"
                        },
                        "睢宁县": {
                            "code": "320324"
                        },
                        "贾汪区": {
                            "code": "320305"
                        },
                        "邳州市": {
                            "code": "320382"
                        },
                        "铜山区": {
                            "code": "320312"
                        },
                        "鼓楼区": {
                            "code": "320302"
                        }
                    }
                },
                "扬州市": {
                    "code": "321000",
                    "country": {
                        "仪征市": {
                            "code": "321081"
                        },
                        "宝应县": {
                            "code": "321023"
                        },
                        "广陵区": {
                            "code": "321002"
                        },
                        "江都区": {
                            "code": "321012"
                        },
                        "邗江区": {
                            "code": "321003"
                        },
                        "高邮市": {
                            "code": "321084"
                        }
                    }
                },
                "无锡市": {
                    "code": "320200",
                    "country": {
                        "宜兴市": {
                            "code": "320282"
                        },
                        "惠山区": {
                            "code": "320206"
                        },
                        "新吴区": {
                            "code": "320214"
                        },
                        "梁溪区": {
                            "code": "320213"
                        },
                        "江阴市": {
                            "code": "320281"
                        },
                        "滨湖区": {
                            "code": "320211"
                        },
                        "锡山区": {
                            "code": "320205"
                        }
                    }
                },
                "泰州市": {
                    "code": "321200",
                    "country": {
                        "兴化市": {
                            "code": "321281"
                        },
                        "姜堰区": {
                            "code": "321204"
                        },
                        "泰兴市": {
                            "code": "321283"
                        },
                        "海陵区": {
                            "code": "321202"
                        },
                        "靖江市": {
                            "code": "321282"
                        },
                        "高港区": {
                            "code": "321203"
                        }
                    }
                },
                "淮安市": {
                    "code": "320800",
                    "country": {
                        "洪泽区": {
                            "code": "320813"
                        },
                        "涟水县": {
                            "code": "320826"
                        },
                        "淮安区": {
                            "code": "320803"
                        },
                        "淮阴区": {
                            "code": "320804"
                        },
                        "清江浦区": {
                            "code": "320812"
                        },
                        "盱眙县": {
                            "code": "320830"
                        },
                        "金湖县": {
                            "code": "320831"
                        }
                    }
                },
                "盐城市": {
                    "code": "320900",
                    "country": {
                        "东台市": {
                            "code": "320981"
                        },
                        "亭湖区": {
                            "code": "320902"
                        },
                        "响水县": {
                            "code": "320921"
                        },
                        "大丰区": {
                            "code": "320904"
                        },
                        "射阳县": {
                            "code": "320924"
                        },
                        "建湖县": {
                            "code": "320925"
                        },
                        "滨海县": {
                            "code": "320922"
                        },
                        "盐都区": {
                            "code": "320903"
                        },
                        "阜宁县": {
                            "code": "320923"
                        }
                    }
                },
                "苏州市": {
                    "code": "320500",
                    "country": {
                        "吴中区": {
                            "code": "320506"
                        },
                        "吴江区": {
                            "code": "320509"
                        },
                        "太仓市": {
                            "code": "320585"
                        },
                        "姑苏区": {
                            "code": "320508"
                        },
                        "常熟市": {
                            "code": "320581"
                        },
                        "张家港市": {
                            "code": "320582"
                        },
                        "昆山市": {
                            "code": "320583"
                        },
                        "相城区": {
                            "code": "320507"
                        },
                        "虎丘区": {
                            "code": "320505"
                        }
                    }
                },
                "连云港市": {
                    "code": "320700",
                    "country": {
                        "东海县": {
                            "code": "320722"
                        },
                        "海州区": {
                            "code": "320706"
                        },
                        "灌云县": {
                            "code": "320723"
                        },
                        "灌南县": {
                            "code": "320724"
                        },
                        "赣榆区": {
                            "code": "320707"
                        },
                        "连云区": {
                            "code": "320703"
                        }
                    }
                },
                "镇江市": {
                    "code": "321100",
                    "country": {
                        "丹徒区": {
                            "code": "321112"
                        },
                        "丹阳市": {
                            "code": "321181"
                        },
                        "京口区": {
                            "code": "321102"
                        },
                        "句容市": {
                            "code": "321183"
                        },
                        "扬中市": {
                            "code": "321182"
                        },
                        "润州区": {
                            "code": "321111"
                        }
                    }
                }
            },
            "code": "320000"
        },
        "江西省": {
            "city": {
                "上饶市": {
                    "code": "361100",
                    "country": {
                        "万年县": {
                            "code": "361129"
                        },
                        "余干县": {
                            "code": "361127"
                        },
                        "信州区": {
                            "code": "361102"
                        },
                        "婺源县": {
                            "code": "361130"
                        },
                        "广丰区": {
                            "code": "361103"
                        },
                        "广信区": {
                            "code": "361104"
                        },
                        "弋阳县": {
                            "code": "361126"
                        },
                        "德兴市": {
                            "code": "361181"
                        },
                        "横峰县": {
                            "code": "361125"
                        },
                        "玉山县": {
                            "code": "361123"
                        },
                        "鄱阳县": {
                            "code": "361128"
                        },
                        "铅山县": {
                            "code": "361124"
                        }
                    }
                },
                "九江市": {
                    "code": "360400",
                    "country": {
                        "修水县": {
                            "code": "360424"
                        },
                        "共青城市": {
                            "code": "360482"
                        },
                        "庐山市": {
                            "code": "360483"
                        },
                        "彭泽县": {
                            "code": "360430"
                        },
                        "德安县": {
                            "code": "360426"
                        },
                        "柴桑区": {
                            "code": "360404"
                        },
                        "武宁县": {
                            "code": "360423"
                        },
                        "永修县": {
                            "code": "360425"
                        },
                        "浔阳区": {
                            "code": "360403"
                        },
                        "湖口县": {
                            "code": "360429"
                        },
                        "濂溪区": {
                            "code": "360402"
                        },
                        "瑞昌市": {
                            "code": "360481"
                        },
                        "都昌县": {
                            "code": "360428"
                        }
                    }
                },
                "南昌市": {
                    "code": "360100",
                    "country": {
                        "东湖区": {
                            "code": "360102"
                        },
                        "南昌县": {
                            "code": "360121"
                        },
                        "安义县": {
                            "code": "360123"
                        },
                        "新建区": {
                            "code": "360112"
                        },
                        "红谷滩区": {
                            "code": "360113"
                        },
                        "西湖区": {
                            "code": "360103"
                        },
                        "进贤县": {
                            "code": "360124"
                        },
                        "青云谱区": {
                            "code": "360104"
                        },
                        "青山湖区": {
                            "code": "360111"
                        }
                    }
                },
                "吉安市": {
                    "code": "360800",
                    "country": {
                        "万安县": {
                            "code": "360828"
                        },
                        "井冈山市": {
                            "code": "360881"
                        },
                        "吉安县": {
                            "code": "360821"
                        },
                        "吉州区": {
                            "code": "360802"
                        },
                        "吉水县": {
                            "code": "360822"
                        },
                        "安福县": {
                            "code": "360829"
                        },
                        "峡江县": {
                            "code": "360823"
                        },
                        "新干县": {
                            "code": "360824"
                        },
                        "永丰县": {
                            "code": "360825"
                        },
                        "永新县": {
                            "code": "360830"
                        },
                        "泰和县": {
                            "code": "360826"
                        },
                        "遂川县": {
                            "code": "360827"
                        },
                        "青原区": {
                            "code": "360803"
                        }
                    }
                },
                "宜春市": {
                    "code": "360900",
                    "country": {
                        "万载县": {
                            "code": "360922"
                        },
                        "上高县": {
                            "code": "360923"
                        },
                        "丰城市": {
                            "code": "360981"
                        },
                        "奉新县": {
                            "code": "360921"
                        },
                        "宜丰县": {
                            "code": "360924"
                        },
                        "樟树市": {
                            "code": "360982"
                        },
                        "袁州区": {
                            "code": "360902"
                        },
                        "铜鼓县": {
                            "code": "360926"
                        },
                        "靖安县": {
                            "code": "360925"
                        },
                        "高安市": {
                            "code": "360983"
                        }
                    }
                },
                "抚州市": {
                    "code": "361000",
                    "country": {
                        "东乡区": {
                            "code": "361003"
                        },
                        "临川区": {
                            "code": "361002"
                        },
                        "乐安县": {
                            "code": "361025"
                        },
                        "南丰县": {
                            "code": "361023"
                        },
                        "南城县": {
                            "code": "361021"
                        },
                        "宜黄县": {
                            "code": "361026"
                        },
                        "崇仁县": {
                            "code": "361024"
                        },
                        "广昌县": {
                            "code": "361030"
                        },
                        "资溪县": {
                            "code": "361028"
                        },
                        "金溪县": {
                            "code": "361027"
                        },
                        "黎川县": {
                            "code": "361022"
                        }
                    }
                },
                "新余市": {
                    "code": "360500",
                    "country": {
                        "分宜县": {
                            "code": "360521"
                        },
                        "渝水区": {
                            "code": "360502"
                        }
                    }
                },
                "景德镇市": {
                    "code": "360200",
                    "country": {
                        "乐平市": {
                            "code": "360281"
                        },
                        "昌江区": {
                            "code": "360202"
                        },
                        "浮梁县": {
                            "code": "360222"
                        },
                        "珠山区": {
                            "code": "360203"
                        }
                    }
                },
                "萍乡市": {
                    "code": "360300",
                    "country": {
                        "上栗县": {
                            "code": "360322"
                        },
                        "安源区": {
                            "code": "360302"
                        },
                        "湘东区": {
                            "code": "360313"
                        },
                        "芦溪县": {
                            "code": "360323"
                        },
                        "莲花县": {
                            "code": "360321"
                        }
                    }
                },
                "赣州市": {
                    "code": "360700",
                    "country": {
                        "上犹县": {
                            "code": "360724"
                        },
                        "于都县": {
                            "code": "360731"
                        },
                        "会昌县": {
                            "code": "360733"
                        },
                        "信丰县": {
                            "code": "360722"
                        },
                        "全南县": {
                            "code": "360729"
                        },
                        "兴国县": {
                            "code": "360732"
                        },
                        "南康区": {
                            "code": "360703"
                        },
                        "大余县": {
                            "code": "360723"
                        },
                        "宁都县": {
                            "code": "360730"
                        },
                        "安远县": {
                            "code": "360726"
                        },
                        "定南县": {
                            "code": "360728"
                        },
                        "寻乌县": {
                            "code": "360734"
                        },
                        "崇义县": {
                            "code": "360725"
                        },
                        "瑞金市": {
                            "code": "360781"
                        },
                        "石城县": {
                            "code": "360735"
                        },
                        "章贡区": {
                            "code": "360702"
                        },
                        "赣县区": {
                            "code": "360704"
                        },
                        "龙南县": {
                            "code": "360727"
                        }
                    }
                },
                "鹰潭市": {
                    "code": "360600",
                    "country": {
                        "余江区": {
                            "code": "360603"
                        },
                        "月湖区": {
                            "code": "360602"
                        },
                        "贵溪市": {
                            "code": "360681"
                        }
                    }
                }
            },
            "code": "360000"
        },
        "河北省": {
            "city": {
                "保定市": {
                    "code": "130600",
                    "country": {
                        "博野县": {
                            "code": "130637"
                        },
                        "唐县": {
                            "code": "130627"
                        },
                        "安国市": {
                            "code": "130683"
                        },
                        "安新县": {
                            "code": "130632"
                        },
                        "定兴县": {
                            "code": "130626"
                        },
                        "定州市": {
                            "code": "130682"
                        },
                        "容城县": {
                            "code": "130629"
                        },
                        "徐水区": {
                            "code": "130609"
                        },
                        "易县": {
                            "code": "130633"
                        },
                        "曲阳县": {
                            "code": "130634"
                        },
                        "望都县": {
                            "code": "130631"
                        },
                        "涞水县": {
                            "code": "130623"
                        },
                        "涞源县": {
                            "code": "130630"
                        },
                        "涿州市": {
                            "code": "130681"
                        },
                        "清苑区": {
                            "code": "130608"
                        },
                        "满城区": {
                            "code": "130607"
                        },
                        "竞秀区": {
                            "code": "130602"
                        },
                        "莲池区": {
                            "code": "130606"
                        },
                        "蠡县": {
                            "code": "130635"
                        },
                        "阜平县": {
                            "code": "130624"
                        },
                        "雄县": {
                            "code": "130638"
                        },
                        "顺平县": {
                            "code": "130636"
                        },
                        "高碑店市": {
                            "code": "130684"
                        },
                        "高阳县": {
                            "code": "130628"
                        }
                    }
                },
                "唐山市": {
                    "code": "130200",
                    "country": {
                        "丰南区": {
                            "code": "130207"
                        },
                        "丰润区": {
                            "code": "130208"
                        },
                        "乐亭县": {
                            "code": "130225"
                        },
                        "古冶区": {
                            "code": "130204"
                        },
                        "开平区": {
                            "code": "130205"
                        },
                        "曹妃甸区": {
                            "code": "130209"
                        },
                        "滦南县": {
                            "code": "130224"
                        },
                        "滦州市": {
                            "code": "130284"
                        },
                        "玉田县": {
                            "code": "130229"
                        },
                        "路北区": {
                            "code": "130203"
                        },
                        "路南区": {
                            "code": "130202"
                        },
                        "迁安市": {
                            "code": "130283"
                        },
                        "迁西县": {
                            "code": "130227"
                        },
                        "遵化市": {
                            "code": "130281"
                        }
                    }
                },
                "廊坊市": {
                    "code": "131000",
                    "country": {
                        "三河市": {
                            "code": "131082"
                        },
                        "固安县": {
                            "code": "131022"
                        },
                        "大厂回族自治县": {
                            "code": "131028"
                        },
                        "大城县": {
                            "code": "131025"
                        },
                        "安次区": {
                            "code": "131002"
                        },
                        "广阳区": {
                            "code": "131003"
                        },
                        "文安县": {
                            "code": "131026"
                        },
                        "永清县": {
                            "code": "131023"
                        },
                        "霸州市": {
                            "code": "131081"
                        },
                        "香河县": {
                            "code": "131024"
                        }
                    }
                },
                "张家口市": {
                    "code": "130700",
                    "country": {
                        "万全区": {
                            "code": "130708"
                        },
                        "下花园区": {
                            "code": "130706"
                        },
                        "宣化区": {
                            "code": "130705"
                        },
                        "尚义县": {
                            "code": "130725"
                        },
                        "崇礼区": {
                            "code": "130709"
                        },
                        "康保县": {
                            "code": "130723"
                        },
                        "张北县": {
                            "code": "130722"
                        },
                        "怀安县": {
                            "code": "130728"
                        },
                        "怀来县": {
                            "code": "130730"
                        },
                        "桥东区": {
                            "code": "130702"
                        },
                        "桥西区": {
                            "code": "130703"
                        },
                        "沽源县": {
                            "code": "130724"
                        },
                        "涿鹿县": {
                            "code": "130731"
                        },
                        "蔚县": {
                            "code": "130726"
                        },
                        "赤城县": {
                            "code": "130732"
                        },
                        "阳原县": {
                            "code": "130727"
                        }
                    }
                },
                "承德市": {
                    "code": "130800",
                    "country": {
                        "丰宁满族自治县": {
                            "code": "130826"
                        },
                        "兴隆县": {
                            "code": "130822"
                        },
                        "双桥区": {
                            "code": "130802"
                        },
                        "双滦区": {
                            "code": "130803"
                        },
                        "围场满族蒙古族自治县": {
                            "code": "130828"
                        },
                        "宽城满族自治县": {
                            "code": "130827"
                        },
                        "平泉市": {
                            "code": "130881"
                        },
                        "承德县": {
                            "code": "130821"
                        },
                        "滦平县": {
                            "code": "130824"
                        },
                        "隆化县": {
                            "code": "130825"
                        },
                        "鹰手营子矿区": {
                            "code": "130804"
                        }
                    }
                },
                "沧州市": {
                    "code": "130900",
                    "country": {
                        "东光县": {
                            "code": "130923"
                        },
                        "任丘市": {
                            "code": "130982"
                        },
                        "南皮县": {
                            "code": "130927"
                        },
                        "吴桥县": {
                            "code": "130928"
                        },
                        "孟村回族自治县": {
                            "code": "130930"
                        },
                        "新华区": {
                            "code": "130902"
                        },
                        "沧县": {
                            "code": "130921"
                        },
                        "河间市": {
                            "code": "130984"
                        },
                        "泊头市": {
                            "code": "130981"
                        },
                        "海兴县": {
                            "code": "130924"
                        },
                        "献县": {
                            "code": "130929"
                        },
                        "盐山县": {
                            "code": "130925"
                        },
                        "肃宁县": {
                            "code": "130926"
                        },
                        "运河区": {
                            "code": "130903"
                        },
                        "青县": {
                            "code": "130922"
                        },
                        "黄骅市": {
                            "code": "130983"
                        }
                    }
                },
                "石家庄市": {
                    "code": "130100",
                    "country": {
                        "井陉县": {
                            "code": "130121"
                        },
                        "井陉矿区": {
                            "code": "130107"
                        },
                        "元氏县": {
                            "code": "130132"
                        },
                        "平山县": {
                            "code": "130131"
                        },
                        "新乐市": {
                            "code": "130184"
                        },
                        "新华区": {
                            "code": "130105"
                        },
                        "无极县": {
                            "code": "130130"
                        },
                        "晋州市": {
                            "code": "130183"
                        },
                        "栾城区": {
                            "code": "130111"
                        },
                        "桥西区": {
                            "code": "130104"
                        },
                        "正定县": {
                            "code": "130123"
                        },
                        "深泽县": {
                            "code": "130128"
                        },
                        "灵寿县": {
                            "code": "130126"
                        },
                        "藁城区": {
                            "code": "130109"
                        },
                        "行唐县": {
                            "code": "130125"
                        },
                        "裕华区": {
                            "code": "130108"
                        },
                        "赞皇县": {
                            "code": "130129"
                        },
                        "赵县": {
                            "code": "130133"
                        },
                        "辛集市": {
                            "code": "130181"
                        },
                        "长安区": {
                            "code": "130102"
                        },
                        "高邑县": {
                            "code": "130127"
                        },
                        "鹿泉区": {
                            "code": "130110"
                        }
                    }
                },
                "秦皇岛市": {
                    "code": "130300",
                    "country": {
                        "北戴河区": {
                            "code": "130304"
                        },
                        "卢龙县": {
                            "code": "130324"
                        },
                        "山海关区": {
                            "code": "130303"
                        },
                        "抚宁区": {
                            "code": "130306"
                        },
                        "昌黎县": {
                            "code": "130322"
                        },
                        "海港区": {
                            "code": "130302"
                        },
                        "青龙满族自治县": {
                            "code": "130321"
                        }
                    }
                },
                "衡水市": {
                    "code": "131100",
                    "country": {
                        "冀州区": {
                            "code": "131103"
                        },
                        "安平县": {
                            "code": "131125"
                        },
                        "故城县": {
                            "code": "131126"
                        },
                        "景县": {
                            "code": "131127"
                        },
                        "枣强县": {
                            "code": "131121"
                        },
                        "桃城区": {
                            "code": "131102"
                        },
                        "武强县": {
                            "code": "131123"
                        },
                        "武邑县": {
                            "code": "131122"
                        },
                        "深州市": {
                            "code": "131182"
                        },
                        "阜城县": {
                            "code": "131128"
                        },
                        "饶阳县": {
                            "code": "131124"
                        }
                    }
                },
                "邢台市": {
                    "code": "130500",
                    "country": {
                        "临城县": {
                            "code": "130522"
                        },
                        "临西县": {
                            "code": "130535"
                        },
                        "任县": {
                            "code": "130526"
                        },
                        "内丘县": {
                            "code": "130523"
                        },
                        "南和县": {
                            "code": "130527"
                        },
                        "南宫市": {
                            "code": "130581"
                        },
                        "威县": {
                            "code": "130533"
                        },
                        "宁晋县": {
                            "code": "130528"
                        },
                        "巨鹿县": {
                            "code": "130529"
                        },
                        "平乡县": {
                            "code": "130532"
                        },
                        "广宗县": {
                            "code": "130531"
                        },
                        "新河县": {
                            "code": "130530"
                        },
                        "柏乡县": {
                            "code": "130524"
                        },
                        "桥东区": {
                            "code": "130502"
                        },
                        "桥西区": {
                            "code": "130503"
                        },
                        "沙河市": {
                            "code": "130582"
                        },
                        "清河县": {
                            "code": "130534"
                        },
                        "邢台县": {
                            "code": "130521"
                        },
                        "隆尧县": {
                            "code": "130525"
                        }
                    }
                },
                "邯郸市": {
                    "code": "130400",
                    "country": {
                        "丛台区": {
                            "code": "130403"
                        },
                        "临漳县": {
                            "code": "130423"
                        },
                        "复兴区": {
                            "code": "130404"
                        },
                        "大名县": {
                            "code": "130425"
                        },
                        "峰峰矿区": {
                            "code": "130406"
                        },
                        "广平县": {
                            "code": "130432"
                        },
                        "成安县": {
                            "code": "130424"
                        },
                        "曲周县": {
                            "code": "130435"
                        },
                        "武安市": {
                            "code": "130481"
                        },
                        "永年区": {
                            "code": "130408"
                        },
                        "涉县": {
                            "code": "130426"
                        },
                        "磁县": {
                            "code": "130427"
                        },
                        "肥乡区": {
                            "code": "130407"
                        },
                        "邯山区": {
                            "code": "130402"
                        },
                        "邱县": {
                            "code": "130430"
                        },
                        "馆陶县": {
                            "code": "130433"
                        },
                        "魏县": {
                            "code": "130434"
                        },
                        "鸡泽县": {
                            "code": "130431"
                        }
                    }
                }
            },
            "code": "130000"
        },
        "河南省": {
            "city": {
                "三门峡市": {
                    "code": "411200",
                    "country": {
                        "义马市": {
                            "code": "411281"
                        },
                        "卢氏县": {
                            "code": "411224"
                        },
                        "渑池县": {
                            "code": "411221"
                        },
                        "湖滨区": {
                            "code": "411202"
                        },
                        "灵宝市": {
                            "code": "411282"
                        },
                        "陕州区": {
                            "code": "411203"
                        }
                    }
                },
                "信阳市": {
                    "code": "411500",
                    "country": {
                        "光山县": {
                            "code": "411522"
                        },
                        "商城县": {
                            "code": "411524"
                        },
                        "固始县": {
                            "code": "411525"
                        },
                        "平桥区": {
                            "code": "411503"
                        },
                        "息县": {
                            "code": "411528"
                        },
                        "新县": {
                            "code": "411523"
                        },
                        "浉河区": {
                            "code": "411502"
                        },
                        "淮滨县": {
                            "code": "411527"
                        },
                        "潢川县": {
                            "code": "411526"
                        },
                        "罗山县": {
                            "code": "411521"
                        }
                    }
                },
                "南阳市": {
                    "code": "411300",
                    "country": {
                        "内乡县": {
                            "code": "411325"
                        },
                        "南召县": {
                            "code": "411321"
                        },
                        "卧龙区": {
                            "code": "411303"
                        },
                        "唐河县": {
                            "code": "411328"
                        },
                        "宛城区": {
                            "code": "411302"
                        },
                        "新野县": {
                            "code": "411329"
                        },
                        "方城县": {
                            "code": "411322"
                        },
                        "桐柏县": {
                            "code": "411330"
                        },
                        "淅川县": {
                            "code": "411326"
                        },
                        "社旗县": {
                            "code": "411327"
                        },
                        "西峡县": {
                            "code": "411323"
                        },
                        "邓州市": {
                            "code": "411381"
                        },
                        "镇平县": {
                            "code": "411324"
                        }
                    }
                },
                "周口市": {
                    "code": "411600",
                    "country": {
                        "商水县": {
                            "code": "411623"
                        },
                        "太康县": {
                            "code": "411627"
                        },
                        "川汇区": {
                            "code": "411602"
                        },
                        "扶沟县": {
                            "code": "411621"
                        },
                        "沈丘县": {
                            "code": "411624"
                        },
                        "淮阳区": {
                            "code": "411603"
                        },
                        "西华县": {
                            "code": "411622"
                        },
                        "郸城县": {
                            "code": "411625"
                        },
                        "项城市": {
                            "code": "411681"
                        },
                        "鹿邑县": {
                            "code": "411628"
                        }
                    }
                },
                "商丘市": {
                    "code": "411400",
                    "country": {
                        "夏邑县": {
                            "code": "411426"
                        },
                        "宁陵县": {
                            "code": "411423"
                        },
                        "柘城县": {
                            "code": "411424"
                        },
                        "梁园区": {
                            "code": "411402"
                        },
                        "民权县": {
                            "code": "411421"
                        },
                        "永城市": {
                            "code": "411481"
                        },
                        "睢县": {
                            "code": "411422"
                        },
                        "睢阳区": {
                            "code": "411403"
                        },
                        "虞城县": {
                            "code": "411425"
                        }
                    }
                },
                "安阳市": {
                    "code": "410500",
                    "country": {
                        "内黄县": {
                            "code": "410527"
                        },
                        "北关区": {
                            "code": "410503"
                        },
                        "安阳县": {
                            "code": "410522"
                        },
                        "文峰区": {
                            "code": "410502"
                        },
                        "林州市": {
                            "code": "410581"
                        },
                        "殷都区": {
                            "code": "410505"
                        },
                        "汤阴县": {
                            "code": "410523"
                        },
                        "滑县": {
                            "code": "410526"
                        },
                        "龙安区": {
                            "code": "410506"
                        }
                    }
                },
                "平顶山市": {
                    "code": "410400",
                    "country": {
                        "卫东区": {
                            "code": "410403"
                        },
                        "叶县": {
                            "code": "410422"
                        },
                        "宝丰县": {
                            "code": "410421"
                        },
                        "新华区": {
                            "code": "410402"
                        },
                        "汝州市": {
                            "code": "410482"
                        },
                        "湛河区": {
                            "code": "410411"
                        },
                        "石龙区": {
                            "code": "410404"
                        },
                        "舞钢市": {
                            "code": "410481"
                        },
                        "郏县": {
                            "code": "410425"
                        },
                        "鲁山县": {
                            "code": "410423"
                        }
                    }
                },
                "开封市": {
                    "code": "410200",
                    "country": {
                        "兰考县": {
                            "code": "410225"
                        },
                        "尉氏县": {
                            "code": "410223"
                        },
                        "杞县": {
                            "code": "410221"
                        },
                        "祥符区": {
                            "code": "410212"
                        },
                        "禹王台区": {
                            "code": "410205"
                        },
                        "通许县": {
                            "code": "410222"
                        },
                        "顺河回族区": {
                            "code": "410203"
                        },
                        "鼓楼区": {
                            "code": "410204"
                        },
                        "龙亭区": {
                            "code": "410202"
                        }
                    }
                },
                "新乡市": {
                    "code": "410700",
                    "country": {
                        "凤泉区": {
                            "code": "410704"
                        },
                        "卫滨区": {
                            "code": "410703"
                        },
                        "卫辉市": {
                            "code": "410781"
                        },
                        "原阳县": {
                            "code": "410725"
                        },
                        "封丘县": {
                            "code": "410727"
                        },
                        "延津县": {
                            "code": "410726"
                        },
                        "新乡县": {
                            "code": "410721"
                        },
                        "牧野区": {
                            "code": "410711"
                        },
                        "红旗区": {
                            "code": "410702"
                        },
                        "获嘉县": {
                            "code": "410724"
                        },
                        "辉县市": {
                            "code": "410782"
                        },
                        "长垣市": {
                            "code": "410783"
                        }
                    }
                },
                "洛阳市": {
                    "code": "410300",
                    "country": {
                        "伊川县": {
                            "code": "410329"
                        },
                        "偃师市": {
                            "code": "410381"
                        },
                        "吉利区": {
                            "code": "410306"
                        },
                        "孟津县": {
                            "code": "410322"
                        },
                        "宜阳县": {
                            "code": "410327"
                        },
                        "嵩县": {
                            "code": "410325"
                        },
                        "新安县": {
                            "code": "410323"
                        },
                        "栾川县": {
                            "code": "410324"
                        },
                        "汝阳县": {
                            "code": "410326"
                        },
                        "洛宁县": {
                            "code": "410328"
                        },
                        "洛龙区": {
                            "code": "410311"
                        },
                        "涧西区": {
                            "code": "410305"
                        },
                        "瀍河回族区": {
                            "code": "410304"
                        },
                        "老城区": {
                            "code": "410302"
                        },
                        "西工区": {
                            "code": "410303"
                        }
                    }
                },
                "漯河市": {
                    "code": "411100",
                    "country": {
                        "临颍县": {
                            "code": "411122"
                        },
                        "召陵区": {
                            "code": "411104"
                        },
                        "源汇区": {
                            "code": "411102"
                        },
                        "舞阳县": {
                            "code": "411121"
                        },
                        "郾城区": {
                            "code": "411103"
                        }
                    }
                },
                "濮阳市": {
                    "code": "410900",
                    "country": {
                        "华龙区": {
                            "code": "410902"
                        },
                        "南乐县": {
                            "code": "410923"
                        },
                        "台前县": {
                            "code": "410927"
                        },
                        "清丰县": {
                            "code": "410922"
                        },
                        "濮阳县": {
                            "code": "410928"
                        },
                        "范县": {
                            "code": "410926"
                        }
                    }
                },
                "焦作市": {
                    "code": "410800",
                    "country": {
                        "中站区": {
                            "code": "410803"
                        },
                        "修武县": {
                            "code": "410821"
                        },
                        "博爱县": {
                            "code": "410822"
                        },
                        "孟州市": {
                            "code": "410883"
                        },
                        "山阳区": {
                            "code": "410811"
                        },
                        "武陟县": {
                            "code": "410823"
                        },
                        "沁阳市": {
                            "code": "410882"
                        },
                        "温县": {
                            "code": "410825"
                        },
                        "解放区": {
                            "code": "410802"
                        },
                        "马村区": {
                            "code": "410804"
                        }
                    }
                },
                "许昌市": {
                    "code": "411000",
                    "country": {
                        "建安区": {
                            "code": "411003"
                        },
                        "禹州市": {
                            "code": "411081"
                        },
                        "襄城县": {
                            "code": "411025"
                        },
                        "鄢陵县": {
                            "code": "411024"
                        },
                        "长葛市": {
                            "code": "411082"
                        },
                        "魏都区": {
                            "code": "411002"
                        }
                    }
                },
                "郑州市": {
                    "code": "410100",
                    "country": {
                        "上街区": {
                            "code": "410106"
                        },
                        "中原区": {
                            "code": "410102"
                        },
                        "中牟县": {
                            "code": "410122"
                        },
                        "二七区": {
                            "code": "410103"
                        },
                        "巩义市": {
                            "code": "410181"
                        },
                        "惠济区": {
                            "code": "410108"
                        },
                        "新密市": {
                            "code": "410183"
                        },
                        "新郑市": {
                            "code": "410184"
                        },
                        "登封市": {
                            "code": "410185"
                        },
                        "管城回族区": {
                            "code": "410104"
                        },
                        "荥阳市": {
                            "code": "410182"
                        },
                        "金水区": {
                            "code": "410105"
                        }
                    }
                },
                "驻马店市": {
                    "code": "411700",
                    "country": {
                        "上蔡县": {
                            "code": "411722"
                        },
                        "平舆县": {
                            "code": "411723"
                        },
                        "新蔡县": {
                            "code": "411729"
                        },
                        "正阳县": {
                            "code": "411724"
                        },
                        "汝南县": {
                            "code": "411727"
                        },
                        "泌阳县": {
                            "code": "411726"
                        },
                        "确山县": {
                            "code": "411725"
                        },
                        "西平县": {
                            "code": "411721"
                        },
                        "遂平县": {
                            "code": "411728"
                        },
                        "驿城区": {
                            "code": "411702"
                        }
                    }
                },
                "鹤壁市": {
                    "code": "410600",
                    "country": {
                        "山城区": {
                            "code": "410603"
                        },
                        "浚县": {
                            "code": "410621"
                        },
                        "淇县": {
                            "code": "410622"
                        },
                        "淇滨区": {
                            "code": "410611"
                        },
                        "鹤山区": {
                            "code": "410602"
                        }
                    }
                }
            },
            "code": "410000"
        },
        "浙江省": {
            "city": {
                "丽水市": {
                    "code": "331100",
                    "country": {
                        "云和县": {
                            "code": "331125"
                        },
                        "庆元县": {
                            "code": "331126"
                        },
                        "景宁畲族自治县": {
                            "code": "331127"
                        },
                        "松阳县": {
                            "code": "331124"
                        },
                        "缙云县": {
                            "code": "331122"
                        },
                        "莲都区": {
                            "code": "331102"
                        },
                        "遂昌县": {
                            "code": "331123"
                        },
                        "青田县": {
                            "code": "331121"
                        },
                        "龙泉市": {
                            "code": "331181"
                        }
                    }
                },
                "台州市": {
                    "code": "331000",
                    "country": {
                        "三门县": {
                            "code": "331022"
                        },
                        "临海市": {
                            "code": "331082"
                        },
                        "仙居县": {
                            "code": "331024"
                        },
                        "天台县": {
                            "code": "331023"
                        },
                        "椒江区": {
                            "code": "331002"
                        },
                        "温岭市": {
                            "code": "331081"
                        },
                        "玉环市": {
                            "code": "331083"
                        },
                        "路桥区": {
                            "code": "331004"
                        },
                        "黄岩区": {
                            "code": "331003"
                        }
                    }
                },
                "嘉兴市": {
                    "code": "330400",
                    "country": {
                        "南湖区": {
                            "code": "330402"
                        },
                        "嘉善县": {
                            "code": "330421"
                        },
                        "平湖市": {
                            "code": "330482"
                        },
                        "桐乡市": {
                            "code": "330483"
                        },
                        "海宁市": {
                            "code": "330481"
                        },
                        "海盐县": {
                            "code": "330424"
                        },
                        "秀洲区": {
                            "code": "330411"
                        }
                    }
                },
                "宁波市": {
                    "code": "330200",
                    "country": {
                        "余姚市": {
                            "code": "330281"
                        },
                        "北仑区": {
                            "code": "330206"
                        },
                        "奉化区": {
                            "code": "330213"
                        },
                        "宁海县": {
                            "code": "330226"
                        },
                        "慈溪市": {
                            "code": "330282"
                        },
                        "江北区": {
                            "code": "330205"
                        },
                        "海曙区": {
                            "code": "330203"
                        },
                        "象山县": {
                            "code": "330225"
                        },
                        "鄞州区": {
                            "code": "330212"
                        },
                        "镇海区": {
                            "code": "330211"
                        }
                    }
                },
                "杭州市": {
                    "code": "330100",
                    "country": {
                        "上城区": {
                            "code": "330102"
                        },
                        "下城区": {
                            "code": "330103"
                        },
                        "临安区": {
                            "code": "330112"
                        },
                        "余杭区": {
                            "code": "330110"
                        },
                        "富阳区": {
                            "code": "330111"
                        },
                        "建德市": {
                            "code": "330182"
                        },
                        "拱墅区": {
                            "code": "330105"
                        },
                        "桐庐县": {
                            "code": "330122"
                        },
                        "江干区": {
                            "code": "330104"
                        },
                        "淳安县": {
                            "code": "330127"
                        },
                        "滨江区": {
                            "code": "330108"
                        },
                        "萧山区": {
                            "code": "330109"
                        },
                        "西湖区": {
                            "code": "330106"
                        }
                    }
                },
                "温州市": {
                    "code": "330300",
                    "country": {
                        "乐清市": {
                            "code": "330382"
                        },
                        "平阳县": {
                            "code": "330326"
                        },
                        "文成县": {
                            "code": "330328"
                        },
                        "永嘉县": {
                            "code": "330324"
                        },
                        "泰顺县": {
                            "code": "330329"
                        },
                        "洞头区": {
                            "code": "330305"
                        },
                        "瑞安市": {
                            "code": "330381"
                        },
                        "瓯海区": {
                            "code": "330304"
                        },
                        "苍南县": {
                            "code": "330327"
                        },
                        "鹿城区": {
                            "code": "330302"
                        },
                        "龙港市": {
                            "code": "330383"
                        },
                        "龙湾区": {
                            "code": "330303"
                        }
                    }
                },
                "湖州市": {
                    "code": "330500",
                    "country": {
                        "南浔区": {
                            "code": "330503"
                        },
                        "吴兴区": {
                            "code": "330502"
                        },
                        "安吉县": {
                            "code": "330523"
                        },
                        "德清县": {
                            "code": "330521"
                        },
                        "长兴县": {
                            "code": "330522"
                        }
                    }
                },
                "绍兴市": {
                    "code": "330600",
                    "country": {
                        "上虞区": {
                            "code": "330604"
                        },
                        "嵊州市": {
                            "code": "330683"
                        },
                        "新昌县": {
                            "code": "330624"
                        },
                        "柯桥区": {
                            "code": "330603"
                        },
                        "诸暨市": {
                            "code": "330681"
                        },
                        "越城区": {
                            "code": "330602"
                        }
                    }
                },
                "舟山市": {
                    "code": "330900",
                    "country": {
                        "定海区": {
                            "code": "330902"
                        },
                        "岱山县": {
                            "code": "330921"
                        },
                        "嵊泗县": {
                            "code": "330922"
                        },
                        "普陀区": {
                            "code": "330903"
                        }
                    }
                },
                "衢州市": {
                    "code": "330800",
                    "country": {
                        "常山县": {
                            "code": "330822"
                        },
                        "开化县": {
                            "code": "330824"
                        },
                        "柯城区": {
                            "code": "330802"
                        },
                        "江山市": {
                            "code": "330881"
                        },
                        "衢江区": {
                            "code": "330803"
                        },
                        "龙游县": {
                            "code": "330825"
                        }
                    }
                },
                "金华市": {
                    "code": "330700",
                    "country": {
                        "东阳市": {
                            "code": "330783"
                        },
                        "义乌市": {
                            "code": "330782"
                        },
                        "兰溪市": {
                            "code": "330781"
                        },
                        "婺城区": {
                            "code": "330702"
                        },
                        "武义县": {
                            "code": "330723"
                        },
                        "永康市": {
                            "code": "330784"
                        },
                        "浦江县": {
                            "code": "330726"
                        },
                        "磐安县": {
                            "code": "330727"
                        },
                        "金东区": {
                            "code": "330703"
                        }
                    }
                }
            },
            "code": "330000"
        },
        "海南省": {
            "city": {
                "三亚市": {
                    "code": "460200",
                    "country": {
                        "吉阳区": {
                            "code": "460203"
                        },
                        "天涯区": {
                            "code": "460204"
                        },
                        "崖州区": {
                            "code": "460205"
                        },
                        "海棠区": {
                            "code": "460202"
                        }
                    }
                },
                "三沙市☆": {
                    "code": "460300",
                    "country": {}
                },
                "儋州市": {
                    "code": "460400",
                    "country": {}
                },
                "海口市": {
                    "code": "460100",
                    "country": {
                        "琼山区": {
                            "code": "460107"
                        },
                        "秀英区": {
                            "code": "460105"
                        },
                        "美兰区": {
                            "code": "460108"
                        },
                        "龙华区": {
                            "code": "460106"
                        }
                    }
                }
            },
            "code": "460000"
        },
        "湖北省": {
            "city": {
                "十堰市": {
                    "code": "420300",
                    "country": {
                        "丹江口市": {
                            "code": "420381"
                        },
                        "张湾区": {
                            "code": "420303"
                        },
                        "房县": {
                            "code": "420325"
                        },
                        "竹山县": {
                            "code": "420323"
                        },
                        "竹溪县": {
                            "code": "420324"
                        },
                        "茅箭区": {
                            "code": "420302"
                        },
                        "郧西县": {
                            "code": "420322"
                        },
                        "郧阳区": {
                            "code": "420304"
                        }
                    }
                },
                "咸宁市": {
                    "code": "421200",
                    "country": {
                        "咸安区": {
                            "code": "421202"
                        },
                        "嘉鱼县": {
                            "code": "421221"
                        },
                        "崇阳县": {
                            "code": "421223"
                        },
                        "赤壁市": {
                            "code": "421281"
                        },
                        "通城县": {
                            "code": "421222"
                        },
                        "通山县": {
                            "code": "421224"
                        }
                    }
                },
                "孝感市": {
                    "code": "420900",
                    "country": {
                        "云梦县": {
                            "code": "420923"
                        },
                        "大悟县": {
                            "code": "420922"
                        },
                        "孝南区": {
                            "code": "420902"
                        },
                        "孝昌县": {
                            "code": "420921"
                        },
                        "安陆市": {
                            "code": "420982"
                        },
                        "应城市": {
                            "code": "420981"
                        },
                        "汉川市": {
                            "code": "420984"
                        }
                    }
                },
                "宜昌市": {
                    "code": "420500",
                    "country": {
                        "五峰土家族自治县": {
                            "code": "420529"
                        },
                        "伍家岗区": {
                            "code": "420503"
                        },
                        "兴山县": {
                            "code": "420526"
                        },
                        "夷陵区": {
                            "code": "420506"
                        },
                        "宜都市": {
                            "code": "420581"
                        },
                        "当阳市": {
                            "code": "420582"
                        },
                        "枝江市": {
                            "code": "420583"
                        },
                        "点军区": {
                            "code": "420504"
                        },
                        "猇亭区": {
                            "code": "420505"
                        },
                        "秭归县": {
                            "code": "420527"
                        },
                        "西陵区": {
                            "code": "420502"
                        },
                        "远安县": {
                            "code": "420525"
                        },
                        "长阳土家族自治县": {
                            "code": "420528"
                        }
                    }
                },
                "恩施土家族苗族自治州": {
                    "code": "422800",
                    "country": {
                        "利川市": {
                            "code": "422802"
                        },
                        "咸丰县": {
                            "code": "422826"
                        },
                        "宣恩县": {
                            "code": "422825"
                        },
                        "巴东县": {
                            "code": "422823"
                        },
                        "建始县": {
                            "code": "422822"
                        },
                        "恩施市": {
                            "code": "422801"
                        },
                        "来凤县": {
                            "code": "422827"
                        },
                        "鹤峰县": {
                            "code": "422828"
                        }
                    }
                },
                "武汉市": {
                    "code": "420100",
                    "country": {
                        "东西湖区": {
                            "code": "420112"
                        },
                        "新洲区": {
                            "code": "420117"
                        },
                        "武昌区": {
                            "code": "420106"
                        },
                        "汉南区": {
                            "code": "420113"
                        },
                        "汉阳区": {
                            "code": "420105"
                        },
                        "江夏区": {
                            "code": "420115"
                        },
                        "江岸区": {
                            "code": "420102"
                        },
                        "江汉区": {
                            "code": "420103"
                        },
                        "洪山区": {
                            "code": "420111"
                        },
                        "硚口区": {
                            "code": "420104"
                        },
                        "蔡甸区": {
                            "code": "420114"
                        },
                        "青山区": {
                            "code": "420107"
                        },
                        "黄陂区": {
                            "code": "420116"
                        }
                    }
                },
                "荆州市": {
                    "code": "421000",
                    "country": {
                        "公安县": {
                            "code": "421022"
                        },
                        "松滋市": {
                            "code": "421087"
                        },
                        "江陵县": {
                            "code": "421024"
                        },
                        "沙市区": {
                            "code": "421002"
                        },
                        "洪湖市": {
                            "code": "421083"
                        },
                        "监利县": {
                            "code": "421023"
                        },
                        "石首市": {
                            "code": "421081"
                        },
                        "荆州区": {
                            "code": "421003"
                        }
                    }
                },
                "荆门市": {
                    "code": "420800",
                    "country": {
                        "东宝区": {
                            "code": "420802"
                        },
                        "京山市": {
                            "code": "420882"
                        },
                        "掇刀区": {
                            "code": "420804"
                        },
                        "沙洋县": {
                            "code": "420822"
                        },
                        "钟祥市": {
                            "code": "420881"
                        }
                    }
                },
                "襄阳市": {
                    "code": "420600",
                    "country": {
                        "保康县": {
                            "code": "420626"
                        },
                        "南漳县": {
                            "code": "420624"
                        },
                        "宜城市": {
                            "code": "420684"
                        },
                        "枣阳市": {
                            "code": "420683"
                        },
                        "樊城区": {
                            "code": "420606"
                        },
                        "老河口市": {
                            "code": "420682"
                        },
                        "襄城区": {
                            "code": "420602"
                        },
                        "襄州区": {
                            "code": "420607"
                        },
                        "谷城县": {
                            "code": "420625"
                        }
                    }
                },
                "鄂州市": {
                    "code": "420700",
                    "country": {
                        "华容区": {
                            "code": "420703"
                        },
                        "梁子湖区": {
                            "code": "420702"
                        },
                        "鄂城区": {
                            "code": "420704"
                        }
                    }
                },
                "随州市": {
                    "code": "421300",
                    "country": {
                        "广水市": {
                            "code": "421381"
                        },
                        "曾都区": {
                            "code": "421303"
                        },
                        "随县": {
                            "code": "421321"
                        }
                    }
                },
                "黄冈市": {
                    "code": "421100",
                    "country": {
                        "团风县": {
                            "code": "421121"
                        },
                        "武穴市": {
                            "code": "421182"
                        },
                        "浠水县": {
                            "code": "421125"
                        },
                        "红安县": {
                            "code": "421122"
                        },
                        "罗田县": {
                            "code": "421123"
                        },
                        "英山县": {
                            "code": "421124"
                        },
                        "蕲春县": {
                            "code": "421126"
                        },
                        "麻城市": {
                            "code": "421181"
                        },
                        "黄州区": {
                            "code": "421102"
                        },
                        "黄梅县": {
                            "code": "421127"
                        }
                    }
                },
                "黄石市": {
                    "code": "420200",
                    "country": {
                        "下陆区": {
                            "code": "420204"
                        },
                        "大冶市": {
                            "code": "420281"
                        },
                        "西塞山区": {
                            "code": "420203"
                        },
                        "铁山区": {
                            "code": "420205"
                        },
                        "阳新县": {
                            "code": "420222"
                        },
                        "黄石港区": {
                            "code": "420202"
                        }
                    }
                }
            },
            "code": "420000"
        },
        "湖南省": {
            "city": {
                "娄底市": {
                    "code": "431300",
                    "country": {
                        "冷水江市": {
                            "code": "431381"
                        },
                        "双峰县": {
                            "code": "431321"
                        },
                        "娄星区": {
                            "code": "431302"
                        },
                        "新化县": {
                            "code": "431322"
                        },
                        "涟源市": {
                            "code": "431382"
                        }
                    }
                },
                "岳阳市": {
                    "code": "430600",
                    "country": {
                        "临湘市": {
                            "code": "430682"
                        },
                        "云溪区": {
                            "code": "430603"
                        },
                        "华容县": {
                            "code": "430623"
                        },
                        "君山区": {
                            "code": "430611"
                        },
                        "岳阳县": {
                            "code": "430621"
                        },
                        "岳阳楼区": {
                            "code": "430602"
                        },
                        "平江县": {
                            "code": "430626"
                        },
                        "汨罗市": {
                            "code": "430681"
                        },
                        "湘阴县": {
                            "code": "430624"
                        }
                    }
                },
                "常德市": {
                    "code": "430700",
                    "country": {
                        "临澧县": {
                            "code": "430724"
                        },
                        "安乡县": {
                            "code": "430721"
                        },
                        "桃源县": {
                            "code": "430725"
                        },
                        "武陵区": {
                            "code": "430702"
                        },
                        "汉寿县": {
                            "code": "430722"
                        },
                        "津市市": {
                            "code": "430781"
                        },
                        "澧县": {
                            "code": "430723"
                        },
                        "石门县": {
                            "code": "430726"
                        },
                        "鼎城区": {
                            "code": "430703"
                        }
                    }
                },
                "张家界市": {
                    "code": "430800",
                    "country": {
                        "慈利县": {
                            "code": "430821"
                        },
                        "桑植县": {
                            "code": "430822"
                        },
                        "武陵源区": {
                            "code": "430811"
                        },
                        "永定区": {
                            "code": "430802"
                        }
                    }
                },
                "怀化市": {
                    "code": "431200",
                    "country": {
                        "中方县": {
                            "code": "431221"
                        },
                        "会同县": {
                            "code": "431225"
                        },
                        "新晃侗族自治县": {
                            "code": "431227"
                        },
                        "沅陵县": {
                            "code": "431222"
                        },
                        "洪江市": {
                            "code": "431281"
                        },
                        "溆浦县": {
                            "code": "431224"
                        },
                        "芷江侗族自治县": {
                            "code": "431228"
                        },
                        "辰溪县": {
                            "code": "431223"
                        },
                        "通道侗族自治县": {
                            "code": "431230"
                        },
                        "靖州苗族侗族自治县": {
                            "code": "431229"
                        },
                        "鹤城区": {
                            "code": "431202"
                        },
                        "麻阳苗族自治县": {
                            "code": "431226"
                        }
                    }
                },
                "株洲市": {
                    "code": "430200",
                    "country": {
                        "天元区": {
                            "code": "430211"
                        },
                        "攸县": {
                            "code": "430223"
                        },
                        "渌口区": {
                            "code": "430212"
                        },
                        "炎陵县": {
                            "code": "430225"
                        },
                        "石峰区": {
                            "code": "430204"
                        },
                        "芦淞区": {
                            "code": "430203"
                        },
                        "茶陵县": {
                            "code": "430224"
                        },
                        "荷塘区": {
                            "code": "430202"
                        },
                        "醴陵市": {
                            "code": "430281"
                        }
                    }
                },
                "永州市": {
                    "code": "431100",
                    "country": {
                        "东安县": {
                            "code": "431122"
                        },
                        "冷水滩区": {
                            "code": "431103"
                        },
                        "双牌县": {
                            "code": "431123"
                        },
                        "宁远县": {
                            "code": "431126"
                        },
                        "新田县": {
                            "code": "431128"
                        },
                        "江华瑶族自治县": {
                            "code": "431129"
                        },
                        "江永县": {
                            "code": "431125"
                        },
                        "祁阳县": {
                            "code": "431121"
                        },
                        "蓝山县": {
                            "code": "431127"
                        },
                        "道县": {
                            "code": "431124"
                        },
                        "零陵区": {
                            "code": "431102"
                        }
                    }
                },
                "湘潭市": {
                    "code": "430300",
                    "country": {
                        "岳塘区": {
                            "code": "430304"
                        },
                        "湘乡市": {
                            "code": "430381"
                        },
                        "湘潭县": {
                            "code": "430321"
                        },
                        "雨湖区": {
                            "code": "430302"
                        },
                        "韶山市": {
                            "code": "430382"
                        }
                    }
                },
                "湘西土家族苗族自治州": {
                    "code": "433100",
                    "country": {
                        "保靖县": {
                            "code": "433125"
                        },
                        "凤凰县": {
                            "code": "433123"
                        },
                        "古丈县": {
                            "code": "433126"
                        },
                        "吉首市": {
                            "code": "433101"
                        },
                        "永顺县": {
                            "code": "433127"
                        },
                        "泸溪县": {
                            "code": "433122"
                        },
                        "花垣县": {
                            "code": "433124"
                        },
                        "龙山县": {
                            "code": "433130"
                        }
                    }
                },
                "益阳市": {
                    "code": "430900",
                    "country": {
                        "南县": {
                            "code": "430921"
                        },
                        "安化县": {
                            "code": "430923"
                        },
                        "桃江县": {
                            "code": "430922"
                        },
                        "沅江市": {
                            "code": "430981"
                        },
                        "资阳区": {
                            "code": "430902"
                        },
                        "赫山区": {
                            "code": "430903"
                        }
                    }
                },
                "衡阳市": {
                    "code": "430400",
                    "country": {
                        "南岳区": {
                            "code": "430412"
                        },
                        "常宁市": {
                            "code": "430482"
                        },
                        "珠晖区": {
                            "code": "430405"
                        },
                        "石鼓区": {
                            "code": "430407"
                        },
                        "祁东县": {
                            "code": "430426"
                        },
                        "耒阳市": {
                            "code": "430481"
                        },
                        "蒸湘区": {
                            "code": "430408"
                        },
                        "衡东县": {
                            "code": "430424"
                        },
                        "衡南县": {
                            "code": "430422"
                        },
                        "衡山县": {
                            "code": "430423"
                        },
                        "衡阳县": {
                            "code": "430421"
                        },
                        "雁峰区": {
                            "code": "430406"
                        }
                    }
                },
                "邵阳市": {
                    "code": "430500",
                    "country": {
                        "北塔区": {
                            "code": "430511"
                        },
                        "双清区": {
                            "code": "430502"
                        },
                        "城步苗族自治县": {
                            "code": "430529"
                        },
                        "大祥区": {
                            "code": "430503"
                        },
                        "新宁县": {
                            "code": "430528"
                        },
                        "新邵县": {
                            "code": "430522"
                        },
                        "武冈市": {
                            "code": "430581"
                        },
                        "洞口县": {
                            "code": "430525"
                        },
                        "绥宁县": {
                            "code": "430527"
                        },
                        "邵东市": {
                            "code": "430582"
                        },
                        "邵阳县": {
                            "code": "430523"
                        },
                        "隆回县": {
                            "code": "430524"
                        }
                    }
                },
                "郴州市": {
                    "code": "431000",
                    "country": {
                        "临武县": {
                            "code": "431025"
                        },
                        "北湖区": {
                            "code": "431002"
                        },
                        "嘉禾县": {
                            "code": "431024"
                        },
                        "安仁县": {
                            "code": "431028"
                        },
                        "宜章县": {
                            "code": "431022"
                        },
                        "桂东县": {
                            "code": "431027"
                        },
                        "桂阳县": {
                            "code": "431021"
                        },
                        "永兴县": {
                            "code": "431023"
                        },
                        "汝城县": {
                            "code": "431026"
                        },
                        "苏仙区": {
                            "code": "431003"
                        },
                        "资兴市": {
                            "code": "431081"
                        }
                    }
                },
                "长沙市": {
                    "code": "430100",
                    "country": {
                        "天心区": {
                            "code": "430103"
                        },
                        "宁乡市": {
                            "code": "430182"
                        },
                        "岳麓区": {
                            "code": "430104"
                        },
                        "开福区": {
                            "code": "430105"
                        },
                        "望城区": {
                            "code": "430112"
                        },
                        "浏阳市": {
                            "code": "430181"
                        },
                        "芙蓉区": {
                            "code": "430102"
                        },
                        "长沙县": {
                            "code": "430121"
                        },
                        "雨花区": {
                            "code": "430111"
                        }
                    }
                }
            },
            "code": "430000"
        },
        "澳门特别行政区": {
            "city": {},
            "code": "820000"
        },
        "甘肃省": {
            "city": {
                "临夏回族自治州": {
                    "code": "622900",
                    "country": {
                        "东乡族自治县": {
                            "code": "622926"
                        },
                        "临夏县": {
                            "code": "622921"
                        },
                        "临夏市": {
                            "code": "622901"
                        },
                        "和政县": {
                            "code": "622925"
                        },
                        "广河县": {
                            "code": "622924"
                        },
                        "康乐县": {
                            "code": "622922"
                        },
                        "永靖县": {
                            "code": "622923"
                        },
                        "积石山保安族东乡族撒拉族自治县": {
                            "code": "622927"
                        }
                    }
                },
                "兰州市": {
                    "code": "620100",
                    "country": {
                        "七里河区": {
                            "code": "620103"
                        },
                        "城关区": {
                            "code": "620102"
                        },
                        "安宁区": {
                            "code": "620105"
                        },
                        "榆中县": {
                            "code": "620123"
                        },
                        "永登县": {
                            "code": "620121"
                        },
                        "皋兰县": {
                            "code": "620122"
                        },
                        "红古区": {
                            "code": "620111"
                        },
                        "西固区": {
                            "code": "620104"
                        }
                    }
                },
                "嘉峪关市": {
                    "code": "620200",
                    "country": {}
                },
                "天水市": {
                    "code": "620500",
                    "country": {
                        "张家川回族自治县": {
                            "code": "620525"
                        },
                        "武山县": {
                            "code": "620524"
                        },
                        "清水县": {
                            "code": "620521"
                        },
                        "甘谷县": {
                            "code": "620523"
                        },
                        "秦安县": {
                            "code": "620522"
                        },
                        "秦州区": {
                            "code": "620502"
                        },
                        "麦积区": {
                            "code": "620503"
                        }
                    }
                },
                "定西市": {
                    "code": "621100",
                    "country": {
                        "临洮县": {
                            "code": "621124"
                        },
                        "安定区": {
                            "code": "621102"
                        },
                        "岷县": {
                            "code": "621126"
                        },
                        "渭源县": {
                            "code": "621123"
                        },
                        "漳县": {
                            "code": "621125"
                        },
                        "通渭县": {
                            "code": "621121"
                        },
                        "陇西县": {
                            "code": "621122"
                        }
                    }
                },
                "平凉市": {
                    "code": "620800",
                    "country": {
                        "华亭市": {
                            "code": "620881"
                        },
                        "崆峒区": {
                            "code": "620802"
                        },
                        "崇信县": {
                            "code": "620823"
                        },
                        "庄浪县": {
                            "code": "620825"
                        },
                        "泾川县": {
                            "code": "620821"
                        },
                        "灵台县": {
                            "code": "620822"
                        },
                        "静宁县": {
                            "code": "620826"
                        }
                    }
                },
                "庆阳市": {
                    "code": "621000",
                    "country": {
                        "华池县": {
                            "code": "621023"
                        },
                        "合水县": {
                            "code": "621024"
                        },
                        "宁县": {
                            "code": "621026"
                        },
                        "庆城县": {
                            "code": "621021"
                        },
                        "正宁县": {
                            "code": "621025"
                        },
                        "环县": {
                            "code": "621022"
                        },
                        "西峰区": {
                            "code": "621002"
                        },
                        "镇原县": {
                            "code": "621027"
                        }
                    }
                },
                "张掖市": {
                    "code": "620700",
                    "country": {
                        "临泽县": {
                            "code": "620723"
                        },
                        "山丹县": {
                            "code": "620725"
                        },
                        "民乐县": {
                            "code": "620722"
                        },
                        "甘州区": {
                            "code": "620702"
                        },
                        "肃南裕固族自治县": {
                            "code": "620721"
                        },
                        "高台县": {
                            "code": "620724"
                        }
                    }
                },
                "武威市": {
                    "code": "620600",
                    "country": {
                        "凉州区": {
                            "code": "620602"
                        },
                        "古浪县": {
                            "code": "620622"
                        },
                        "天祝藏族自治县": {
                            "code": "620623"
                        },
                        "民勤县": {
                            "code": "620621"
                        }
                    }
                },
                "甘南藏族自治州": {
                    "code": "623000",
                    "country": {
                        "临潭县": {
                            "code": "623021"
                        },
                        "卓尼县": {
                            "code": "623022"
                        },
                        "合作市": {
                            "code": "623001"
                        },
                        "夏河县": {
                            "code": "623027"
                        },
                        "玛曲县": {
                            "code": "623025"
                        },
                        "碌曲县": {
                            "code": "623026"
                        },
                        "舟曲县": {
                            "code": "623023"
                        },
                        "迭部县": {
                            "code": "623024"
                        }
                    }
                },
                "白银市": {
                    "code": "620400",
                    "country": {
                        "会宁县": {
                            "code": "620422"
                        },
                        "平川区": {
                            "code": "620403"
                        },
                        "景泰县": {
                            "code": "620423"
                        },
                        "白银区": {
                            "code": "620402"
                        },
                        "靖远县": {
                            "code": "620421"
                        }
                    }
                },
                "酒泉市": {
                    "code": "620900",
                    "country": {
                        "敦煌市": {
                            "code": "620982"
                        },
                        "玉门市": {
                            "code": "620981"
                        },
                        "瓜州县": {
                            "code": "620922"
                        },
                        "肃北蒙古族自治县": {
                            "code": "620923"
                        },
                        "肃州区": {
                            "code": "620902"
                        },
                        "金塔县": {
                            "code": "620921"
                        },
                        "阿克塞哈萨克族自治县": {
                            "code": "620924"
                        }
                    }
                },
                "金昌市": {
                    "code": "620300",
                    "country": {
                        "永昌县": {
                            "code": "620321"
                        },
                        "金川区": {
                            "code": "620302"
                        }
                    }
                },
                "陇南市": {
                    "code": "621200",
                    "country": {
                        "两当县": {
                            "code": "621228"
                        },
                        "宕昌县": {
                            "code": "621223"
                        },
                        "康县": {
                            "code": "621224"
                        },
                        "徽县": {
                            "code": "621227"
                        },
                        "成县": {
                            "code": "621221"
                        },
                        "文县": {
                            "code": "621222"
                        },
                        "武都区": {
                            "code": "621202"
                        },
                        "礼县": {
                            "code": "621226"
                        },
                        "西和县": {
                            "code": "621225"
                        }
                    }
                }
            },
            "code": "620000"
        },
        "福建省": {
            "city": {
                "三明市": {
                    "code": "350400",
                    "country": {
                        "三元区": {
                            "code": "350403"
                        },
                        "大田县": {
                            "code": "350425"
                        },
                        "宁化县": {
                            "code": "350424"
                        },
                        "将乐县": {
                            "code": "350428"
                        },
                        "尤溪县": {
                            "code": "350426"
                        },
                        "建宁县": {
                            "code": "350430"
                        },
                        "明溪县": {
                            "code": "350421"
                        },
                        "梅列区": {
                            "code": "350402"
                        },
                        "永安市": {
                            "code": "350481"
                        },
                        "沙县": {
                            "code": "350427"
                        },
                        "泰宁县": {
                            "code": "350429"
                        },
                        "清流县": {
                            "code": "350423"
                        }
                    }
                },
                "南平市": {
                    "code": "350700",
                    "country": {
                        "光泽县": {
                            "code": "350723"
                        },
                        "延平区": {
                            "code": "350702"
                        },
                        "建瓯市": {
                            "code": "350783"
                        },
                        "建阳区": {
                            "code": "350703"
                        },
                        "政和县": {
                            "code": "350725"
                        },
                        "松溪县": {
                            "code": "350724"
                        },
                        "武夷山市": {
                            "code": "350782"
                        },
                        "浦城县": {
                            "code": "350722"
                        },
                        "邵武市": {
                            "code": "350781"
                        },
                        "顺昌县": {
                            "code": "350721"
                        }
                    }
                },
                "厦门市": {
                    "code": "350200",
                    "country": {
                        "同安区": {
                            "code": "350212"
                        },
                        "思明区": {
                            "code": "350203"
                        },
                        "海沧区": {
                            "code": "350205"
                        },
                        "湖里区": {
                            "code": "350206"
                        },
                        "翔安区": {
                            "code": "350213"
                        },
                        "集美区": {
                            "code": "350211"
                        }
                    }
                },
                "宁德市": {
                    "code": "350900",
                    "country": {
                        "古田县": {
                            "code": "350922"
                        },
                        "周宁县": {
                            "code": "350925"
                        },
                        "寿宁县": {
                            "code": "350924"
                        },
                        "屏南县": {
                            "code": "350923"
                        },
                        "柘荣县": {
                            "code": "350926"
                        },
                        "福安市": {
                            "code": "350981"
                        },
                        "福鼎市": {
                            "code": "350982"
                        },
                        "蕉城区": {
                            "code": "350902"
                        },
                        "霞浦县": {
                            "code": "350921"
                        }
                    }
                },
                "泉州市": {
                    "code": "350500",
                    "country": {
                        "丰泽区": {
                            "code": "350503"
                        },
                        "南安市": {
                            "code": "350583"
                        },
                        "安溪县": {
                            "code": "350524"
                        },
                        "德化县": {
                            "code": "350526"
                        },
                        "惠安县": {
                            "code": "350521"
                        },
                        "晋江市": {
                            "code": "350582"
                        },
                        "永春县": {
                            "code": "350525"
                        },
                        "泉港区": {
                            "code": "350505"
                        },
                        "洛江区": {
                            "code": "350504"
                        },
                        "石狮市": {
                            "code": "350581"
                        },
                        "金门县☆": {
                            "code": "350527"
                        },
                        "鲤城区": {
                            "code": "350502"
                        }
                    }
                },
                "漳州市": {
                    "code": "350600",
                    "country": {
                        "东山县": {
                            "code": "350626"
                        },
                        "云霄县": {
                            "code": "350622"
                        },
                        "华安县": {
                            "code": "350629"
                        },
                        "南靖县": {
                            "code": "350627"
                        },
                        "平和县": {
                            "code": "350628"
                        },
                        "漳浦县": {
                            "code": "350623"
                        },
                        "芗城区": {
                            "code": "350602"
                        },
                        "诏安县": {
                            "code": "350624"
                        },
                        "长泰县": {
                            "code": "350625"
                        },
                        "龙文区": {
                            "code": "350603"
                        },
                        "龙海市": {
                            "code": "350681"
                        }
                    }
                },
                "福州市": {
                    "code": "350100",
                    "country": {
                        "仓山区": {
                            "code": "350104"
                        },
                        "台江区": {
                            "code": "350103"
                        },
                        "平潭县": {
                            "code": "350128"
                        },
                        "晋安区": {
                            "code": "350111"
                        },
                        "永泰县": {
                            "code": "350125"
                        },
                        "福清市": {
                            "code": "350181"
                        },
                        "罗源县": {
                            "code": "350123"
                        },
                        "连江县": {
                            "code": "350122"
                        },
                        "长乐区": {
                            "code": "350112"
                        },
                        "闽侯县": {
                            "code": "350121"
                        },
                        "闽清县": {
                            "code": "350124"
                        },
                        "马尾区": {
                            "code": "350105"
                        },
                        "鼓楼区": {
                            "code": "350102"
                        }
                    }
                },
                "莆田市": {
                    "code": "350300",
                    "country": {
                        "仙游县": {
                            "code": "350322"
                        },
                        "城厢区": {
                            "code": "350302"
                        },
                        "涵江区": {
                            "code": "350303"
                        },
                        "秀屿区": {
                            "code": "350305"
                        },
                        "荔城区": {
                            "code": "350304"
                        }
                    }
                },
                "龙岩市": {
                    "code": "350800",
                    "country": {
                        "上杭县": {
                            "code": "350823"
                        },
                        "新罗区": {
                            "code": "350802"
                        },
                        "武平县": {
                            "code": "350824"
                        },
                        "永定区": {
                            "code": "350803"
                        },
                        "漳平市": {
                            "code": "350881"
                        },
                        "连城县": {
                            "code": "350825"
                        },
                        "长汀县": {
                            "code": "350821"
                        }
                    }
                }
            },
            "code": "350000"
        },
        "西藏自治区": {
            "city": {
                "山南市": {
                    "code": "540500",
                    "country": {
                        "乃东区": {
                            "code": "540502"
                        },
                        "加查县": {
                            "code": "540528"
                        },
                        "扎囊县": {
                            "code": "540521"
                        },
                        "措美县": {
                            "code": "540526"
                        },
                        "曲松县": {
                            "code": "540525"
                        },
                        "桑日县": {
                            "code": "540523"
                        },
                        "洛扎县": {
                            "code": "540527"
                        },
                        "浪卡子县": {
                            "code": "540531"
                        },
                        "琼结县": {
                            "code": "540524"
                        },
                        "贡嘎县": {
                            "code": "540522"
                        },
                        "错那县": {
                            "code": "540530"
                        },
                        "隆子县": {
                            "code": "540529"
                        }
                    }
                },
                "拉萨市": {
                    "code": "540100",
                    "country": {
                        "城关区": {
                            "code": "540102"
                        },
                        "堆龙德庆区": {
                            "code": "540103"
                        },
                        "墨竹工卡县": {
                            "code": "540127"
                        },
                        "尼木县": {
                            "code": "540123"
                        },
                        "当雄县": {
                            "code": "540122"
                        },
                        "曲水县": {
                            "code": "540124"
                        },
                        "林周县": {
                            "code": "540121"
                        },
                        "达孜区": {
                            "code": "540104"
                        }
                    }
                },
                "日喀则市": {
                    "code": "540200",
                    "country": {
                        "亚东县": {
                            "code": "540233"
                        },
                        "仁布县": {
                            "code": "540229"
                        },
                        "仲巴县": {
                            "code": "540232"
                        },
                        "南木林县": {
                            "code": "540221"
                        },
                        "吉隆县": {
                            "code": "540234"
                        },
                        "定日县": {
                            "code": "540223"
                        },
                        "定结县": {
                            "code": "540231"
                        },
                        "岗巴县": {
                            "code": "540237"
                        },
                        "康马县": {
                            "code": "540230"
                        },
                        "拉孜县": {
                            "code": "540225"
                        },
                        "昂仁县": {
                            "code": "540226"
                        },
                        "桑珠孜区": {
                            "code": "540202"
                        },
                        "江孜县": {
                            "code": "540222"
                        },
                        "白朗县": {
                            "code": "540228"
                        },
                        "聂拉木县": {
                            "code": "540235"
                        },
                        "萨嘎县": {
                            "code": "540236"
                        },
                        "萨迦县": {
                            "code": "540224"
                        },
                        "谢通门县": {
                            "code": "540227"
                        }
                    }
                },
                "昌都市": {
                    "code": "540300",
                    "country": {
                        "丁青县": {
                            "code": "540324"
                        },
                        "八宿县": {
                            "code": "540326"
                        },
                        "卡若区": {
                            "code": "540302"
                        },
                        "察雅县": {
                            "code": "540325"
                        },
                        "左贡县": {
                            "code": "540327"
                        },
                        "江达县": {
                            "code": "540321"
                        },
                        "洛隆县": {
                            "code": "540329"
                        },
                        "类乌齐县": {
                            "code": "540323"
                        },
                        "芒康县": {
                            "code": "540328"
                        },
                        "贡觉县": {
                            "code": "540322"
                        },
                        "边坝县": {
                            "code": "540330"
                        }
                    }
                },
                "林芝市": {
                    "code": "540400",
                    "country": {
                        "墨脱县": {
                            "code": "540423"
                        },
                        "察隅县": {
                            "code": "540425"
                        },
                        "工布江达县": {
                            "code": "540421"
                        },
                        "巴宜区": {
                            "code": "540402"
                        },
                        "朗县": {
                            "code": "540426"
                        },
                        "波密县": {
                            "code": "540424"
                        },
                        "米林县": {
                            "code": "540422"
                        }
                    }
                },
                "那曲市": {
                    "code": "540600",
                    "country": {
                        "双湖县": {
                            "code": "540630"
                        },
                        "嘉黎县": {
                            "code": "540621"
                        },
                        "安多县": {
                            "code": "540624"
                        },
                        "尼玛县": {
                            "code": "540629"
                        },
                        "巴青县": {
                            "code": "540628"
                        },
                        "比如县": {
                            "code": "540622"
                        },
                        "班戈县": {
                            "code": "540627"
                        },
                        "申扎县": {
                            "code": "540625"
                        },
                        "索县": {
                            "code": "540626"
                        },
                        "聂荣县": {
                            "code": "540623"
                        },
                        "色尼区": {
                            "code": "540602"
                        }
                    }
                },
                "阿里地区": {
                    "code": "542500",
                    "country": {
                        "噶尔县": {
                            "code": "542523"
                        },
                        "措勤县": {
                            "code": "542527"
                        },
                        "改则县": {
                            "code": "542526"
                        },
                        "日土县": {
                            "code": "542524"
                        },
                        "普兰县": {
                            "code": "542521"
                        },
                        "札达县": {
                            "code": "542522"
                        },
                        "革吉县": {
                            "code": "542525"
                        }
                    }
                }
            },
            "code": "540000"
        },
        "贵州省": {
            "city": {
                "六盘水市": {
                    "code": "520200",
                    "country": {
                        "六枝特区": {
                            "code": "520203"
                        },
                        "水城县": {
                            "code": "520221"
                        },
                        "盘州市": {
                            "code": "520281"
                        },
                        "钟山区": {
                            "code": "520201"
                        }
                    }
                },
                "安顺市": {
                    "code": "520400",
                    "country": {
                        "关岭布依族苗族自治县": {
                            "code": "520424"
                        },
                        "平坝区": {
                            "code": "520403"
                        },
                        "普定县": {
                            "code": "520422"
                        },
                        "紫云苗族布依族自治县": {
                            "code": "520425"
                        },
                        "西秀区": {
                            "code": "520402"
                        },
                        "镇宁布依族苗族自治县": {
                            "code": "520423"
                        }
                    }
                },
                "毕节市": {
                    "code": "520500",
                    "country": {
                        "七星关区": {
                            "code": "520502"
                        },
                        "大方县": {
                            "code": "520521"
                        },
                        "威宁彝族回族苗族自治县": {
                            "code": "520526"
                        },
                        "纳雍县": {
                            "code": "520525"
                        },
                        "织金县": {
                            "code": "520524"
                        },
                        "赫章县": {
                            "code": "520527"
                        },
                        "金沙县": {
                            "code": "520523"
                        },
                        "黔西县": {
                            "code": "520522"
                        }
                    }
                },
                "贵阳市": {
                    "code": "520100",
                    "country": {
                        "乌当区": {
                            "code": "520112"
                        },
                        "云岩区": {
                            "code": "520103"
                        },
                        "修文县": {
                            "code": "520123"
                        },
                        "南明区": {
                            "code": "520102"
                        },
                        "开阳县": {
                            "code": "520121"
                        },
                        "息烽县": {
                            "code": "520122"
                        },
                        "清镇市": {
                            "code": "520181"
                        },
                        "白云区": {
                            "code": "520113"
                        },
                        "花溪区": {
                            "code": "520111"
                        },
                        "观山湖区": {
                            "code": "520115"
                        }
                    }
                },
                "遵义市": {
                    "code": "520300",
                    "country": {
                        "习水县": {
                            "code": "520330"
                        },
                        "仁怀市": {
                            "code": "520382"
                        },
                        "余庆县": {
                            "code": "520329"
                        },
                        "凤冈县": {
                            "code": "520327"
                        },
                        "务川仡佬族苗族自治县": {
                            "code": "520326"
                        },
                        "播州区": {
                            "code": "520304"
                        },
                        "桐梓县": {
                            "code": "520322"
                        },
                        "正安县": {
                            "code": "520324"
                        },
                        "汇川区": {
                            "code": "520303"
                        },
                        "湄潭县": {
                            "code": "520328"
                        },
                        "红花岗区": {
                            "code": "520302"
                        },
                        "绥阳县": {
                            "code": "520323"
                        },
                        "赤水市": {
                            "code": "520381"
                        },
                        "道真仡佬族苗族自治县": {
                            "code": "520325"
                        }
                    }
                },
                "铜仁市": {
                    "code": "520600",
                    "country": {
                        "万山区": {
                            "code": "520603"
                        },
                        "印江土家族苗族自治县": {
                            "code": "520625"
                        },
                        "德江县": {
                            "code": "520626"
                        },
                        "思南县": {
                            "code": "520624"
                        },
                        "松桃苗族自治县": {
                            "code": "520628"
                        },
                        "江口县": {
                            "code": "520621"
                        },
                        "沿河土家族自治县": {
                            "code": "520627"
                        },
                        "玉屏侗族自治县": {
                            "code": "520622"
                        },
                        "石阡县": {
                            "code": "520623"
                        },
                        "碧江区": {
                            "code": "520602"
                        }
                    }
                },
                "黔东南苗族侗族自治州": {
                    "code": "522600",
                    "country": {
                        "三穗县": {
                            "code": "522624"
                        },
                        "丹寨县": {
                            "code": "522636"
                        },
                        "从江县": {
                            "code": "522633"
                        },
                        "凯里市": {
                            "code": "522601"
                        },
                        "剑河县": {
                            "code": "522629"
                        },
                        "台江县": {
                            "code": "522630"
                        },
                        "天柱县": {
                            "code": "522627"
                        },
                        "岑巩县": {
                            "code": "522626"
                        },
                        "施秉县": {
                            "code": "522623"
                        },
                        "榕江县": {
                            "code": "522632"
                        },
                        "锦屏县": {
                            "code": "522628"
                        },
                        "镇远县": {
                            "code": "522625"
                        },
                        "雷山县": {
                            "code": "522634"
                        },
                        "麻江县": {
                            "code": "522635"
                        },
                        "黄平县": {
                            "code": "522622"
                        },
                        "黎平县": {
                            "code": "522631"
                        }
                    }
                },
                "黔南布依族苗族自治州": {
                    "code": "522700",
                    "country": {
                        "三都水族自治县": {
                            "code": "522732"
                        },
                        "平塘县": {
                            "code": "522727"
                        },
                        "惠水县": {
                            "code": "522731"
                        },
                        "独山县": {
                            "code": "522726"
                        },
                        "瓮安县": {
                            "code": "522725"
                        },
                        "福泉市": {
                            "code": "522702"
                        },
                        "罗甸县": {
                            "code": "522728"
                        },
                        "荔波县": {
                            "code": "522722"
                        },
                        "贵定县": {
                            "code": "522723"
                        },
                        "都匀市": {
                            "code": "522701"
                        },
                        "长顺县": {
                            "code": "522729"
                        },
                        "龙里县": {
                            "code": "522730"
                        }
                    }
                },
                "黔西南布依族苗族自治州": {
                    "code": "522300",
                    "country": {
                        "兴义市": {
                            "code": "522301"
                        },
                        "兴仁市": {
                            "code": "522302"
                        },
                        "册亨县": {
                            "code": "522327"
                        },
                        "安龙县": {
                            "code": "522328"
                        },
                        "普安县": {
                            "code": "522323"
                        },
                        "晴隆县": {
                            "code": "522324"
                        },
                        "望谟县": {
                            "code": "522326"
                        },
                        "贞丰县": {
                            "code": "522325"
                        }
                    }
                }
            },
            "code": "520000"
        },
        "辽宁省": {
            "city": {
                "丹东市": {
                    "code": "210600",
                    "country": {
                        "东港市": {
                            "code": "210681"
                        },
                        "元宝区": {
                            "code": "210602"
                        },
                        "凤城市": {
                            "code": "210682"
                        },
                        "宽甸满族自治县": {
                            "code": "210624"
                        },
                        "振兴区": {
                            "code": "210603"
                        },
                        "振安区": {
                            "code": "210604"
                        }
                    }
                },
                "大连市": {
                    "code": "210200",
                    "country": {
                        "中山区": {
                            "code": "210202"
                        },
                        "庄河市": {
                            "code": "210283"
                        },
                        "旅顺口区": {
                            "code": "210212"
                        },
                        "普兰店区": {
                            "code": "210214"
                        },
                        "沙河口区": {
                            "code": "210204"
                        },
                        "瓦房店市": {
                            "code": "210281"
                        },
                        "甘井子区": {
                            "code": "210211"
                        },
                        "西岗区": {
                            "code": "210203"
                        },
                        "金州区": {
                            "code": "210213"
                        },
                        "长海县": {
                            "code": "210224"
                        }
                    }
                },
                "抚顺市": {
                    "code": "210400",
                    "country": {
                        "东洲区": {
                            "code": "210403"
                        },
                        "抚顺县": {
                            "code": "210421"
                        },
                        "新宾满族自治县": {
                            "code": "210422"
                        },
                        "新抚区": {
                            "code": "210402"
                        },
                        "望花区": {
                            "code": "210404"
                        },
                        "清原满族自治县": {
                            "code": "210423"
                        },
                        "顺城区": {
                            "code": "210411"
                        }
                    }
                },
                "朝阳市": {
                    "code": "211300",
                    "country": {
                        "凌源市": {
                            "code": "211382"
                        },
                        "北票市": {
                            "code": "211381"
                        },
                        "双塔区": {
                            "code": "211302"
                        },
                        "喀喇沁左翼蒙古族自治县": {
                            "code": "211324"
                        },
                        "建平县": {
                            "code": "211322"
                        },
                        "朝阳县": {
                            "code": "211321"
                        },
                        "龙城区": {
                            "code": "211303"
                        }
                    }
                },
                "本溪市": {
                    "code": "210500",
                    "country": {
                        "南芬区": {
                            "code": "210505"
                        },
                        "平山区": {
                            "code": "210502"
                        },
                        "明山区": {
                            "code": "210504"
                        },
                        "本溪满族自治县": {
                            "code": "210521"
                        },
                        "桓仁满族自治县": {
                            "code": "210522"
                        },
                        "溪湖区": {
                            "code": "210503"
                        }
                    }
                },
                "沈阳市": {
                    "code": "210100",
                    "country": {
                        "于洪区": {
                            "code": "210114"
                        },
                        "和平区": {
                            "code": "210102"
                        },
                        "大东区": {
                            "code": "210104"
                        },
                        "康平县": {
                            "code": "210123"
                        },
                        "新民市": {
                            "code": "210181"
                        },
                        "沈北新区": {
                            "code": "210113"
                        },
                        "沈河区": {
                            "code": "210103"
                        },
                        "法库县": {
                            "code": "210124"
                        },
                        "浑南区": {
                            "code": "210112"
                        },
                        "皇姑区": {
                            "code": "210105"
                        },
                        "苏家屯区": {
                            "code": "210111"
                        },
                        "辽中区": {
                            "code": "210115"
                        },
                        "铁西区": {
                            "code": "210106"
                        }
                    }
                },
                "盘锦市": {
                    "code": "211100",
                    "country": {
                        "兴隆台区": {
                            "code": "211103"
                        },
                        "双台子区": {
                            "code": "211102"
                        },
                        "大洼区": {
                            "code": "211104"
                        },
                        "盘山县": {
                            "code": "211122"
                        }
                    }
                },
                "营口市": {
                    "code": "210800",
                    "country": {
                        "大石桥市": {
                            "code": "210882"
                        },
                        "盖州市": {
                            "code": "210881"
                        },
                        "站前区": {
                            "code": "210802"
                        },
                        "老边区": {
                            "code": "210811"
                        },
                        "西市区": {
                            "code": "210803"
                        },
                        "鲅鱼圈区": {
                            "code": "210804"
                        }
                    }
                },
                "葫芦岛市": {
                    "code": "211400",
                    "country": {
                        "兴城市": {
                            "code": "211481"
                        },
                        "南票区": {
                            "code": "211404"
                        },
                        "建昌县": {
                            "code": "211422"
                        },
                        "绥中县": {
                            "code": "211421"
                        },
                        "连山区": {
                            "code": "211402"
                        },
                        "龙港区": {
                            "code": "211403"
                        }
                    }
                },
                "辽阳市": {
                    "code": "211000",
                    "country": {
                        "太子河区": {
                            "code": "211011"
                        },
                        "宏伟区": {
                            "code": "211004"
                        },
                        "弓长岭区": {
                            "code": "211005"
                        },
                        "文圣区": {
                            "code": "211003"
                        },
                        "灯塔市": {
                            "code": "211081"
                        },
                        "白塔区": {
                            "code": "211002"
                        },
                        "辽阳县": {
                            "code": "211021"
                        }
                    }
                },
                "铁岭市": {
                    "code": "211200",
                    "country": {
                        "开原市": {
                            "code": "211282"
                        },
                        "昌图县": {
                            "code": "211224"
                        },
                        "清河区": {
                            "code": "211204"
                        },
                        "西丰县": {
                            "code": "211223"
                        },
                        "调兵山市": {
                            "code": "211281"
                        },
                        "铁岭县": {
                            "code": "211221"
                        },
                        "银州区": {
                            "code": "211202"
                        }
                    }
                },
                "锦州市": {
                    "code": "210700",
                    "country": {
                        "义县": {
                            "code": "210727"
                        },
                        "凌河区": {
                            "code": "210703"
                        },
                        "凌海市": {
                            "code": "210781"
                        },
                        "北镇市": {
                            "code": "210782"
                        },
                        "古塔区": {
                            "code": "210702"
                        },
                        "太和区": {
                            "code": "210711"
                        },
                        "黑山县": {
                            "code": "210726"
                        }
                    }
                },
                "阜新市": {
                    "code": "210900",
                    "country": {
                        "太平区": {
                            "code": "210904"
                        },
                        "彰武县": {
                            "code": "210922"
                        },
                        "新邱区": {
                            "code": "210903"
                        },
                        "海州区": {
                            "code": "210902"
                        },
                        "清河门区": {
                            "code": "210905"
                        },
                        "细河区": {
                            "code": "210911"
                        },
                        "阜新蒙古族自治县": {
                            "code": "210921"
                        }
                    }
                },
                "鞍山市": {
                    "code": "210300",
                    "country": {
                        "千山区": {
                            "code": "210311"
                        },
                        "台安县": {
                            "code": "210321"
                        },
                        "岫岩满族自治县": {
                            "code": "210323"
                        },
                        "海城市": {
                            "code": "210381"
                        },
                        "立山区": {
                            "code": "210304"
                        },
                        "铁东区": {
                            "code": "210302"
                        },
                        "铁西区": {
                            "code": "210303"
                        }
                    }
                }
            },
            "code": "210000"
        },
        "重庆市": {
            "city": {
                "重庆市": {
                    "code": "500000",
                    "country": {
                        "万州区": {
                            "code": "500101"
                        },
                        "九龙坡区": {
                            "code": "500107"
                        },
                        "北碚区": {
                            "code": "500109"
                        },
                        "南岸区": {
                            "code": "500108"
                        },
                        "南川区": {
                            "code": "500119"
                        },
                        "合川区": {
                            "code": "500117"
                        },
                        "大渡口区": {
                            "code": "500104"
                        },
                        "大足区": {
                            "code": "500111"
                        },
                        "巴南区": {
                            "code": "500113"
                        },
                        "开州区": {
                            "code": "500154"
                        },
                        "梁平区": {
                            "code": "500155"
                        },
                        "武隆区": {
                            "code": "500156"
                        },
                        "永川区": {
                            "code": "500118"
                        },
                        "江北区": {
                            "code": "500105"
                        },
                        "江津区": {
                            "code": "500116"
                        },
                        "沙坪坝区": {
                            "code": "500106"
                        },
                        "涪陵区": {
                            "code": "500102"
                        },
                        "渝中区": {
                            "code": "500103"
                        },
                        "渝北区": {
                            "code": "500112"
                        },
                        "潼南区": {
                            "code": "500152"
                        },
                        "璧山区": {
                            "code": "500120"
                        },
                        "綦江区": {
                            "code": "500110"
                        },
                        "荣昌区": {
                            "code": "500153"
                        },
                        "铜梁区": {
                            "code": "500151"
                        },
                        "长寿区": {
                            "code": "500115"
                        },
                        "黔江区": {
                            "code": "500114"
                        }
                    }
                }
            },
            "code": "500000"
        },
        "陕西省": {
            "city": {
                "咸阳市": {
                    "code": "610400",
                    "country": {
                        "三原县": {
                            "code": "610422"
                        },
                        "乾县": {
                            "code": "610424"
                        },
                        "兴平市": {
                            "code": "610481"
                        },
                        "彬州市": {
                            "code": "610482"
                        },
                        "旬邑县": {
                            "code": "610429"
                        },
                        "杨陵区": {
                            "code": "610403"
                        },
                        "武功县": {
                            "code": "610431"
                        },
                        "永寿县": {
                            "code": "610426"
                        },
                        "泾阳县": {
                            "code": "610423"
                        },
                        "淳化县": {
                            "code": "610430"
                        },
                        "渭城区": {
                            "code": "610404"
                        },
                        "礼泉县": {
                            "code": "610425"
                        },
                        "秦都区": {
                            "code": "610402"
                        },
                        "长武县": {
                            "code": "610428"
                        }
                    }
                },
                "商洛市": {
                    "code": "611000",
                    "country": {
                        "丹凤县": {
                            "code": "611022"
                        },
                        "商南县": {
                            "code": "611023"
                        },
                        "商州区": {
                            "code": "611002"
                        },
                        "山阳县": {
                            "code": "611024"
                        },
                        "柞水县": {
                            "code": "611026"
                        },
                        "洛南县": {
                            "code": "611021"
                        },
                        "镇安县": {
                            "code": "611025"
                        }
                    }
                },
                "安康市": {
                    "code": "610900",
                    "country": {
                        "宁陕县": {
                            "code": "610923"
                        },
                        "岚皋县": {
                            "code": "610925"
                        },
                        "平利县": {
                            "code": "610926"
                        },
                        "旬阳县": {
                            "code": "610928"
                        },
                        "汉滨区": {
                            "code": "610902"
                        },
                        "汉阴县": {
                            "code": "610921"
                        },
                        "白河县": {
                            "code": "610929"
                        },
                        "石泉县": {
                            "code": "610922"
                        },
                        "紫阳县": {
                            "code": "610924"
                        },
                        "镇坪县": {
                            "code": "610927"
                        }
                    }
                },
                "宝鸡市": {
                    "code": "610300",
                    "country": {
                        "凤县": {
                            "code": "610330"
                        },
                        "凤翔县": {
                            "code": "610322"
                        },
                        "千阳县": {
                            "code": "610328"
                        },
                        "太白县": {
                            "code": "610331"
                        },
                        "岐山县": {
                            "code": "610323"
                        },
                        "扶风县": {
                            "code": "610324"
                        },
                        "渭滨区": {
                            "code": "610302"
                        },
                        "眉县": {
                            "code": "610326"
                        },
                        "金台区": {
                            "code": "610303"
                        },
                        "陇县": {
                            "code": "610327"
                        },
                        "陈仓区": {
                            "code": "610304"
                        },
                        "麟游县": {
                            "code": "610329"
                        }
                    }
                },
                "延安市": {
                    "code": "610600",
                    "country": {
                        "吴起县": {
                            "code": "610626"
                        },
                        "子长市": {
                            "code": "610681"
                        },
                        "安塞区": {
                            "code": "610603"
                        },
                        "宜川县": {
                            "code": "610630"
                        },
                        "宝塔区": {
                            "code": "610602"
                        },
                        "富县": {
                            "code": "610628"
                        },
                        "延川县": {
                            "code": "610622"
                        },
                        "延长县": {
                            "code": "610621"
                        },
                        "志丹县": {
                            "code": "610625"
                        },
                        "洛川县": {
                            "code": "610629"
                        },
                        "甘泉县": {
                            "code": "610627"
                        },
                        "黄陵县": {
                            "code": "610632"
                        },
                        "黄龙县": {
                            "code": "610631"
                        }
                    }
                },
                "榆林市": {
                    "code": "610800",
                    "country": {
                        "佳县": {
                            "code": "610828"
                        },
                        "吴堡县": {
                            "code": "610829"
                        },
                        "子洲县": {
                            "code": "610831"
                        },
                        "定边县": {
                            "code": "610825"
                        },
                        "府谷县": {
                            "code": "610822"
                        },
                        "榆阳区": {
                            "code": "610802"
                        },
                        "横山区": {
                            "code": "610803"
                        },
                        "清涧县": {
                            "code": "610830"
                        },
                        "神木市": {
                            "code": "610881"
                        },
                        "米脂县": {
                            "code": "610827"
                        },
                        "绥德县": {
                            "code": "610826"
                        },
                        "靖边县": {
                            "code": "610824"
                        }
                    }
                },
                "汉中市": {
                    "code": "610700",
                    "country": {
                        "佛坪县": {
                            "code": "610730"
                        },
                        "勉县": {
                            "code": "610725"
                        },
                        "南郑区": {
                            "code": "610703"
                        },
                        "城固县": {
                            "code": "610722"
                        },
                        "宁强县": {
                            "code": "610726"
                        },
                        "汉台区": {
                            "code": "610702"
                        },
                        "洋县": {
                            "code": "610723"
                        },
                        "留坝县": {
                            "code": "610729"
                        },
                        "略阳县": {
                            "code": "610727"
                        },
                        "西乡县": {
                            "code": "610724"
                        },
                        "镇巴县": {
                            "code": "610728"
                        }
                    }
                },
                "渭南市": {
                    "code": "610500",
                    "country": {
                        "临渭区": {
                            "code": "610502"
                        },
                        "华州区": {
                            "code": "610503"
                        },
                        "华阴市": {
                            "code": "610582"
                        },
                        "合阳县": {
                            "code": "610524"
                        },
                        "大荔县": {
                            "code": "610523"
                        },
                        "富平县": {
                            "code": "610528"
                        },
                        "潼关县": {
                            "code": "610522"
                        },
                        "澄城县": {
                            "code": "610525"
                        },
                        "白水县": {
                            "code": "610527"
                        },
                        "蒲城县": {
                            "code": "610526"
                        },
                        "韩城市": {
                            "code": "610581"
                        }
                    }
                },
                "西安市": {
                    "code": "610100",
                    "country": {
                        "临潼区": {
                            "code": "610115"
                        },
                        "周至县": {
                            "code": "610124"
                        },
                        "新城区": {
                            "code": "610102"
                        },
                        "未央区": {
                            "code": "610112"
                        },
                        "灞桥区": {
                            "code": "610111"
                        },
                        "碑林区": {
                            "code": "610103"
                        },
                        "莲湖区": {
                            "code": "610104"
                        },
                        "蓝田县": {
                            "code": "610122"
                        },
                        "鄠邑区": {
                            "code": "610118"
                        },
                        "长安区": {
                            "code": "610116"
                        },
                        "阎良区": {
                            "code": "610114"
                        },
                        "雁塔区": {
                            "code": "610113"
                        },
                        "高陵区": {
                            "code": "610117"
                        }
                    }
                },
                "铜川市": {
                    "code": "610200",
                    "country": {
                        "印台区": {
                            "code": "610203"
                        },
                        "宜君县": {
                            "code": "610222"
                        },
                        "王益区": {
                            "code": "610202"
                        },
                        "耀州区": {
                            "code": "610204"
                        }
                    }
                }
            },
            "code": "610000"
        },
        "青海省": {
            "city": {
                "果洛藏族自治州": {
                    "code": "632600",
                    "country": {
                        "久治县": {
                            "code": "632625"
                        },
                        "玛多县": {
                            "code": "632626"
                        },
                        "玛沁县": {
                            "code": "632621"
                        },
                        "班玛县": {
                            "code": "632622"
                        },
                        "甘德县": {
                            "code": "632623"
                        },
                        "达日县": {
                            "code": "632624"
                        }
                    }
                },
                "海东市": {
                    "code": "630200",
                    "country": {
                        "乐都区": {
                            "code": "630202"
                        },
                        "互助土族自治县": {
                            "code": "630223"
                        },
                        "化隆回族自治县": {
                            "code": "630224"
                        },
                        "平安区": {
                            "code": "630203"
                        },
                        "循化撒拉族自治县": {
                            "code": "630225"
                        },
                        "民和回族土族自治县": {
                            "code": "630222"
                        }
                    }
                },
                "海北藏族自治州": {
                    "code": "632200",
                    "country": {
                        "刚察县": {
                            "code": "632224"
                        },
                        "海晏县": {
                            "code": "632223"
                        },
                        "祁连县": {
                            "code": "632222"
                        },
                        "门源回族自治县": {
                            "code": "632221"
                        }
                    }
                },
                "海南藏族自治州": {
                    "code": "632500",
                    "country": {
                        "共和县": {
                            "code": "632521"
                        },
                        "兴海县": {
                            "code": "632524"
                        },
                        "同德县": {
                            "code": "632522"
                        },
                        "贵南县": {
                            "code": "632525"
                        },
                        "贵德县": {
                            "code": "632523"
                        }
                    }
                },
                "海西蒙古族藏族自治州": {
                    "code": "632800",
                    "country": {
                        "乌兰县": {
                            "code": "632821"
                        },
                        "天峻县": {
                            "code": "632823"
                        },
                        "德令哈市": {
                            "code": "632802"
                        },
                        "格尔木市": {
                            "code": "632801"
                        },
                        "茫崖市": {
                            "code": "632803"
                        },
                        "都兰县": {
                            "code": "632822"
                        }
                    }
                },
                "玉树藏族自治州": {
                    "code": "632700",
                    "country": {
                        "囊谦县": {
                            "code": "632725"
                        },
                        "曲麻莱县": {
                            "code": "632726"
                        },
                        "杂多县": {
                            "code": "632722"
                        },
                        "治多县": {
                            "code": "632724"
                        },
                        "玉树市": {
                            "code": "632701"
                        },
                        "称多县": {
                            "code": "632723"
                        }
                    }
                },
                "西宁市": {
                    "code": "630100",
                    "country": {
                        "城东区": {
                            "code": "630102"
                        },
                        "城中区": {
                            "code": "630103"
                        },
                        "城北区": {
                            "code": "630105"
                        },
                        "城西区": {
                            "code": "630104"
                        },
                        "大通回族土族自治县": {
                            "code": "630121"
                        },
                        "湟中区": {
                            "code": "630106"
                        },
                        "湟源县": {
                            "code": "630123"
                        }
                    }
                },
                "黄南藏族自治州": {
                    "code": "632300",
                    "country": {
                        "同仁县": {
                            "code": "632321"
                        },
                        "尖扎县": {
                            "code": "632322"
                        },
                        "河南蒙古族自治县": {
                            "code": "632324"
                        },
                        "泽库县": {
                            "code": "632323"
                        }
                    }
                }
            },
            "code": "630000"
        },
        "香港特别行政区": {
            "city": {},
            "code": "810000"
        },
        "黑龙江省": {
            "city": {
                "七台河市": {
                    "code": "230900",
                    "country": {
                        "勃利县": {
                            "code": "230921"
                        },
                        "新兴区": {
                            "code": "230902"
                        },
                        "桃山区": {
                            "code": "230903"
                        },
                        "茄子河区": {
                            "code": "230904"
                        }
                    }
                },
                "伊春市": {
                    "code": "230700",
                    "country": {
                        "丰林县": {
                            "code": "230724"
                        },
                        "乌翠区": {
                            "code": "230718"
                        },
                        "伊美区": {
                            "code": "230717"
                        },
                        "南岔县": {
                            "code": "230726"
                        },
                        "友好区": {
                            "code": "230719"
                        },
                        "嘉荫县": {
                            "code": "230722"
                        },
                        "大箐山县": {
                            "code": "230725"
                        },
                        "汤旺县": {
                            "code": "230723"
                        },
                        "金林区": {
                            "code": "230751"
                        },
                        "铁力市": {
                            "code": "230781"
                        }
                    }
                },
                "佳木斯市": {
                    "code": "230800",
                    "country": {
                        "东风区": {
                            "code": "230805"
                        },
                        "前进区": {
                            "code": "230804"
                        },
                        "同江市": {
                            "code": "230881"
                        },
                        "向阳区": {
                            "code": "230803"
                        },
                        "富锦市": {
                            "code": "230882"
                        },
                        "抚远市": {
                            "code": "230883"
                        },
                        "桦南县": {
                            "code": "230822"
                        },
                        "桦川县": {
                            "code": "230826"
                        },
                        "汤原县": {
                            "code": "230828"
                        },
                        "郊区": {
                            "code": "230811"
                        }
                    }
                },
                "双鸭山市": {
                    "code": "230500",
                    "country": {
                        "友谊县": {
                            "code": "230522"
                        },
                        "四方台区": {
                            "code": "230505"
                        },
                        "宝山区": {
                            "code": "230506"
                        },
                        "宝清县": {
                            "code": "230523"
                        },
                        "尖山区": {
                            "code": "230502"
                        },
                        "岭东区": {
                            "code": "230503"
                        },
                        "集贤县": {
                            "code": "230521"
                        },
                        "饶河县": {
                            "code": "230524"
                        }
                    }
                },
                "哈尔滨市": {
                    "code": "230100",
                    "country": {
                        "五常市": {
                            "code": "230184"
                        },
                        "依兰县": {
                            "code": "230123"
                        },
                        "南岗区": {
                            "code": "230103"
                        },
                        "双城区": {
                            "code": "230113"
                        },
                        "呼兰区": {
                            "code": "230111"
                        },
                        "宾县": {
                            "code": "230125"
                        },
                        "尚志市": {
                            "code": "230183"
                        },
                        "巴彦县": {
                            "code": "230126"
                        },
                        "平房区": {
                            "code": "230108"
                        },
                        "延寿县": {
                            "code": "230129"
                        },
                        "方正县": {
                            "code": "230124"
                        },
                        "木兰县": {
                            "code": "230127"
                        },
                        "松北区": {
                            "code": "230109"
                        },
                        "通河县": {
                            "code": "230128"
                        },
                        "道外区": {
                            "code": "230104"
                        },
                        "道里区": {
                            "code": "230102"
                        },
                        "阿城区": {
                            "code": "230112"
                        },
                        "香坊区": {
                            "code": "230110"
                        }
                    }
                },
                "大兴安岭地区": {
                    "code": "232700",
                    "country": {
                        "呼玛县": {
                            "code": "232721"
                        },
                        "塔河县": {
                            "code": "232722"
                        },
                        "漠河市": {
                            "code": "232701"
                        }
                    }
                },
                "大庆市": {
                    "code": "230600",
                    "country": {
                        "大同区": {
                            "code": "230606"
                        },
                        "杜尔伯特蒙古族自治县": {
                            "code": "230624"
                        },
                        "林甸县": {
                            "code": "230623"
                        },
                        "红岗区": {
                            "code": "230605"
                        },
                        "肇州县": {
                            "code": "230621"
                        },
                        "肇源县": {
                            "code": "230622"
                        },
                        "萨尔图区": {
                            "code": "230602"
                        },
                        "让胡路区": {
                            "code": "230604"
                        },
                        "龙凤区": {
                            "code": "230603"
                        }
                    }
                },
                "牡丹江市": {
                    "code": "231000",
                    "country": {
                        "东宁市": {
                            "code": "231086"
                        },
                        "东安区": {
                            "code": "231002"
                        },
                        "宁安市": {
                            "code": "231084"
                        },
                        "林口县": {
                            "code": "231025"
                        },
                        "海林市": {
                            "code": "231083"
                        },
                        "爱民区": {
                            "code": "231004"
                        },
                        "穆棱市": {
                            "code": "231085"
                        },
                        "绥芬河市": {
                            "code": "231081"
                        },
                        "西安区": {
                            "code": "231005"
                        },
                        "阳明区": {
                            "code": "231003"
                        }
                    }
                },
                "绥化市": {
                    "code": "231200",
                    "country": {
                        "兰西县": {
                            "code": "231222"
                        },
                        "北林区": {
                            "code": "231202"
                        },
                        "安达市": {
                            "code": "231281"
                        },
                        "庆安县": {
                            "code": "231224"
                        },
                        "明水县": {
                            "code": "231225"
                        },
                        "望奎县": {
                            "code": "231221"
                        },
                        "海伦市": {
                            "code": "231283"
                        },
                        "绥棱县": {
                            "code": "231226"
                        },
                        "肇东市": {
                            "code": "231282"
                        },
                        "青冈县": {
                            "code": "231223"
                        }
                    }
                },
                "鸡西市": {
                    "code": "230300",
                    "country": {
                        "城子河区": {
                            "code": "230306"
                        },
                        "密山市": {
                            "code": "230382"
                        },
                        "恒山区": {
                            "code": "230303"
                        },
                        "梨树区": {
                            "code": "230305"
                        },
                        "滴道区": {
                            "code": "230304"
                        },
                        "虎林市": {
                            "code": "230381"
                        },
                        "鸡东县": {
                            "code": "230321"
                        },
                        "鸡冠区": {
                            "code": "230302"
                        },
                        "麻山区": {
                            "code": "230307"
                        }
                    }
                },
                "鹤岗市": {
                    "code": "230400",
                    "country": {
                        "东山区": {
                            "code": "230406"
                        },
                        "兴安区": {
                            "code": "230405"
                        },
                        "兴山区": {
                            "code": "230407"
                        },
                        "南山区": {
                            "code": "230404"
                        },
                        "向阳区": {
                            "code": "230402"
                        },
                        "工农区": {
                            "code": "230403"
                        },
                        "绥滨县": {
                            "code": "230422"
                        },
                        "萝北县": {
                            "code": "230421"
                        }
                    }
                },
                "黑河市": {
                    "code": "231100",
                    "country": {
                        "五大连池市": {
                            "code": "231182"
                        },
                        "北安市": {
                            "code": "231181"
                        },
                        "嫩江市": {
                            "code": "231183"
                        },
                        "孙吴县": {
                            "code": "231124"
                        },
                        "爱辉区": {
                            "code": "231102"
                        },
                        "逊克县": {
                            "code": "231123"
                        }
                    }
                },
                "齐齐哈尔市": {
                    "code": "230200",
                    "country": {
                        "依安县": {
                            "code": "230223"
                        },
                        "克东县": {
                            "code": "230230"
                        },
                        "克山县": {
                            "code": "230229"
                        },
                        "富拉尔基区": {
                            "code": "230206"
                        },
                        "富裕县": {
                            "code": "230227"
                        },
                        "建华区": {
                            "code": "230203"
                        },
                        "拜泉县": {
                            "code": "230231"
                        },
                        "昂昂溪区": {
                            "code": "230205"
                        },
                        "梅里斯达斡尔族区": {
                            "code": "230208"
                        },
                        "泰来县": {
                            "code": "230224"
                        },
                        "甘南县": {
                            "code": "230225"
                        },
                        "碾子山区": {
                            "code": "230207"
                        },
                        "讷河市": {
                            "code": "230281"
                        },
                        "铁锋区": {
                            "code": "230204"
                        },
                        "龙江县": {
                            "code": "230221"
                        },
                        "龙沙区": {
                            "code": "230202"
                        }
                    }
                }
            },
            "code": "230000"
        }
    };